[
{"asin": "B096K9XLHQ", "text": "Socks are soft, and Comfortable, they are not Super Thick, and NOT THIN AT ALLi walk docks all day, used these in timberland PRO BOOTS(My Feet Were happy and DRY) All day.i Work on my feet ALL DAY! so having Great Comfortable Socks is Essential!im here leaving this comment and reivew for those dudes/vatos - who have a wide foot, want a nice sock, not too high, but still down and comfortable i use these for my every day wear now and Work attire.I WILL BE ORDERING MORE, In VARIOUS COLORS. GRACIAS-MERXZILLA", "title": "im a size 13(w) - 12-14(FITME) Always on My FEET!", "location_and_date": "Reviewed in the United States on August 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K9XLHQ", "text": "The Amazon Essentials Men's Cotton Half Cushioned Crew Socks are a practical and budget-friendly option for everyday wear. With their comfortable design, reliable quality, and multipack options, these socks are a convenient choice for men seeking affordable and reliable footwear.One of the standout features of these socks is their comfort. They are made from a soft and breathable cotton fabric that provides a comfortable and cozy feel on the feet. The half cushioning adds an extra layer of padding and support to the soles, enhancing comfort during extended periods of wear. The crew length design offers coverage and protection for the ankles, making them suitable for various types of footwear.The quality of the Amazon Essentials socks is reliable, especially considering their affordable price point. The socks are well-constructed and durable, ensuring they can withstand regular use and multiple washings without losing their shape or softness. The cotton fabric remains comfortable and does not pill excessively, maintaining a neat and tidy appearance over time. In conclusion, the Amazon Essentials Men's Cotton Half Cushioned Crew Socks are affordable and reliable everyday essentials that offer comfort and durability. Their soft cotton fabric, half cushioning, and multipack options make them a practical choice for men seeking comfortable socks without breaking the bank. Whether for casual or professional wear, these socks deliver on their promise of comfort and value.", "title": "Loved this product!!", "location_and_date": "Reviewed in the United States on July 13, 2023", "verified": true, "rating": "4.0"},
{"asin": "B096K9XLHQ", "text": "Needed new dress socks and came across these and...They're amazing!I never realized the difference a good thick sock can make it overall comfort, these were an eye opener! They weren't hot, they didn't bunch up and they were a great fit!", "title": "Very comfortable", "location_and_date": "Reviewed in the United States on August 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K9XLHQ", "text": "I know the world of socks can be vast but I'm a simple guy and I've only known your basic white sock, and as far as the basic white sock is concerned, this might just be the best quality for value. I'm genuinely impressed and cherish these socks above all my others... They're so soft and a perfect thickness, zero discomfort or tightness around the ankle. It's like putting a cloud on my foot.", "title": "Best socks I've ever owned...", "location_and_date": "Reviewed in the United States on August 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K9XLHQ", "text": "They are really good socks my husband loves them they don’t get wet or sweaty, he wears them for work all day everyday except the weekends.", "title": "Great", "location_and_date": "Reviewed in the United States on August 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K9XLHQ", "text": "These socks are good quality but they leave little black fuzz balls in our carpet & it drives me crazy because I feel like I’m constantly having to pick little black fuzzies out of the carpet or out of our bed. Also, when my husband takes these socks off, the bottoms of his feet & between his toes are covered in the black fuzzies too so when he gets in the shower, he leaves a trail of them. We probably won’t be repurchasing.", "title": "Good quality but piling does happen", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B096K9XLHQ", "text": "I bought them for my nephew. he really likes them, he said they are normal they feel good and they fit well he wears a size 8 regular means shoe. First time Washed them in cool water, dryer low heat 20minutes, then had to repeat dryer twice. Our dryer gets very very hot even on low. Do I did NOT want to shrink them first wash  & dry. Did not shrink.", "title": "Good socks", "location_and_date": "Reviewed in the United States on July 25, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K9XLHQ", "text": "I'm shoe size 11 and I first bought the large... too large.  The regular (6 - 12) was the right choice.  They're soft and appear well made.  After washing they fit perfectly.", "title": "Great price on nice socks", "location_and_date": "Reviewed in the United States on August 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K9XLHQ", "text": "After several washes still holds fit and form.", "title": "Form and fit", "location_and_date": "Reviewed in the United States on August 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K9XLHQ", "text": "I wear these socks for work in a physically active job and bought two 10-packs 3 years ago. I started noticing some were getting thin or wearing through on the balls of my feet or heel so I’m throwing some out and buying more. Good value", "title": "Bought 3 years ago, coming back for more.", "location_and_date": "Reviewed in the United States on July 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07NSTK238", "text": "I'm not kidding when I say these are the best socks I've ever bought. I'm talking about the grey heather size 6-12 ankle socks. Unfortunately, Amazon hasn't had these in stock for quite some time (or maybe they sell out right away?). Only the larger size, which I can't comment on. But for this size, it fits my feet perfectly (I wear size 10-10.5 shoes). Other socks in this size range are a little tight on my feet, but these go right on. The thickness is just right, they don't feel too thick but they aren't thin either. I don't get any stretching of the sock where your foot starts to show through the thin material, like you see in some socks.I've been using these pretty much every day for a year and a half, and in all 10 pairs I don't have any holes or fraying or anything like that. I wish I bought more than 10 pairs at the time because I've tried other socks since then (not to replace these, but to expand my wardrobe) and honestly, none have been as good as these. I don't know if the quality is the same across Amazon's other color choices, but I like the solid grey ankle socks so I'm out of luck unless these come back.", "title": "Best socks I've ever bought", "location_and_date": "Reviewed in the United States on August 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07NSTK238", "text": "These are a good value, very comfortable, and are very close to name brands as far as I can tell.  Will update review as I wear them for longevity, but I will absolutely buy them again over Hanes or Fruit of the Loom as things stand right now.", "title": "Better option than I was expecting", "location_and_date": "Reviewed in the United States on August 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07NSTK238", "text": "But still need more elastic Tight around ankles", "title": "Nice socks", "location_and_date": "Reviewed in the United States on August 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07NSTK238", "text": "I like the socks except all the lint. Gets everywhere, even after 2 washes", "title": "So much lint", "location_and_date": "Reviewed in the United States on July 24, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07NSTK238", "text": "Decently thick and soft, cheap, and comfortable. Exactly what I wanted!", "title": "Nice and comfy", "location_and_date": "Reviewed in the United States on August 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07NSTK238", "text": "Based on the price, I figured these socks would be like wearing thin sandpaper that would quickly disintegrate. I could not have been more pleasantly surprised. They are the precise opposite. They are thick, well-made, and soft. It feels like walking on fluffy clouds. It doesn't, but they're very comfortable, and when these do wear out (eventually....I don't think it will be any time soon.), I will be ordering more of these.", "title": "Great!", "location_and_date": "Reviewed in the United States on July 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07NSTK238", "text": "Purchased for my husband and he finds them comfortable", "title": "Just As Described", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07NSTK238", "text": "Very nice item", "title": "Good quality.", "location_and_date": "Reviewed in the United States on August 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07NSTK238", "text": "Muy bueno y cómodas", "title": "Excelente", "location_and_date": "Reviewed in the United States on August 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07NSTK238", "text": "Should have ordered a size smaller. They feel loose. They're still comfortable tho, and I like the colors.", "title": "Big", "location_and_date": "Reviewed in the United States on July 1, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q8JGDRC", "text": "my grandson is 6'5\" and has big feet. regular socks are too small. I bought these for him and he said they are great and long enough for his xlarge feet", "title": "large enough", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "So I’ve always wore these Nike ankle socks like these they were new and always had an issue with falling apart and just getting holes; I bought these bad boys and they’re soft, so comfortable, and have like a tad bit of padding that makes them feel just great. I’m definitely buying these socks again in the future, the material is just so good for the price and all.", "title": "Amazing Amazon socks", "location_and_date": "Reviewed in the United States on June 25, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "Awesome socks. Very soft and comfortable to wear. No sweating.", "title": "Awesome socks", "location_and_date": "Reviewed in the United States on July 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "Exceptional wear, best I have experienced in this type of sock.", "title": "Exactly as described.", "location_and_date": "Reviewed in the United States on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "A good durable sock but it seems a little large.", "title": "Run a bit large", "location_and_date": "Reviewed in the United States on June 15, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q8JGDRC", "text": "Title says it all", "title": "I bought them oversized and am very happy with them.", "location_and_date": "Reviewed in the United States on July 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "Fit my husbands wide feet AND high instep!", "title": "Fit my husbands XXWide feet.", "location_and_date": "Reviewed in the United States on May 28, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q8JGDRC", "text": "I wear a size 12 shoes, and these socks don't fit right.", "title": "Sock is too big.", "location_and_date": "Reviewed in the United States on May 19, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q8JGDRC", "text": "the occasional blue sock day was fun", "title": "does the job and i liked the color option", "location_and_date": "Reviewed in the United States on July 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "would buy again.", "title": "Nice, comfy and sweat absorbent.", "location_and_date": "Reviewed in the United States on May 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K4X3QMJ", "text": "My son is in socks or bare feet all the time and these socks have held up great.He runs around in the grass in socks and they are holding up well without piling or getting holes. I waited several months before reviewing to see how they'd hold up and I'm very pleased with them.He says they are comfy and they stretch and don't hurt his legs but they also have not stretched so much that they fall down and again, we've had them several months now.Will buy again.", "title": "Great for an ative teen!", "location_and_date": "Reviewed in the United States on August 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4X3QMJ", "text": "These socks are just the right size for my size 8 foot; The last batch I bought from hanes were huge; these hug without squeezing too much I think if you have a wide size 11 they may not work, but there 's another inch or 2 for those with larger feet.", "title": "My new favorite socks", "location_and_date": "Reviewed in the United States on July 24, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K4X3QMJ", "text": "These socks are soft, elastic in all aspects of the sock, and very comfortable. Best workout socks I’ve ever worn. One advisory, they should be washed in cold water.", "title": "Better than advertised", "location_and_date": "Reviewed in the United States on August 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4X3QMJ", "text": "I purchased these twice, they are very narrow or tight for the size they are claiming, I have size 10 and bought the size 6-12 and they were just way to tight, returned for the next size up 12-14 and they are still tight, I have to roll them down and thread them on to my feet. Once on they are however quite soft and medium cushy, the tightness will not kill my feet or stop the blood-circulation or anything, but I will not have them all the way up on the calf, too tight for comfort with these socks, not a problem for me since I never wear any socks that way, I always pull the socks up on my feet and then push the excess sock down the ankles. So if I wear them like that I found them to be acceptable for the price. But if you have big feet or big calf's, these are not for you, I would say that if you are a normal10, the size 12-14 might work for you, above that or wide, you will probably have to return them.", "title": "Comfy to a point.", "location_and_date": "Reviewed in the United States on May 8, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K4X3QMJ", "text": "On time and as promised, good fit, stretched perfectly. Good Buy.", "title": "Lightweight for summer", "location_and_date": "Reviewed in the United States on August 1, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K4X3QMJ", "text": "The socks fit great, and are soft. Very happy with them.", "title": "This is excellent", "location_and_date": "Reviewed in the United States on August 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4X3QMJ", "text": "I had no problems", "title": "Fingers went smooth", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4X3QMJ", "text": "Yup ...", "title": "Great socks", "location_and_date": "Reviewed in the United States on August 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4X3QMJ", "text": "Just what i was hoping for.", "title": "Great product", "location_and_date": "Reviewed in the United States on August 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4X3QMJ", "text": "Good one", "title": "Good", "location_and_date": "Reviewed in the United States on August 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "I wear this type of sock daily with work shoes/boots working on houses.  These were recommended by Amazon when i was looking to purchase some more work socks. These are very comfortable and durable. These could be worn with tennis shoes for comfort as well.  i will order more as needed.", "title": "Comfortable and Durable", "location_and_date": "Reviewed in the United States on August 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "Good quality socks.  They didn't fit as expected as I  have long feet.They were too short for me even though I  chose Men's extra large.", "title": "Socks", "location_and_date": "Reviewed in the United States on August 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07F282SF7", "text": "Affordable and good quality sock. Feels comparable to major sports brands like adidas and nikeI wears these for anything and everything. I wear them when working in the hospital, working out in the gym, and when playing soccer. I have had no issues with them. They are a secure fit and don't not slide down at the heel.", "title": "Great quality sock", "location_and_date": "Reviewed in the United States on August 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "I fully expected these to be low quality and that I would be returning them.  After all store brands are almost always the lowest quality.  Well I'm wrong in this case.  They fit well and are comfortable and seem very durable.  I'd buy them again.", "title": "Better Than I expected", "location_and_date": "Reviewed in the United States on August 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "I like these better than another brand I have used. They are still sized right after one washing, whereas the others shrunk up a bit to make them tight. They are just the way I wanted them to be.", "title": "Comfortable not too tight.", "location_and_date": "Reviewed in the United States on August 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "Good socks with a tight fit. Warmer than I expected.The first couple of uses some fibers were left on my fit when taking them off.Overall I like them, but would prefer a little thinner fabric.", "title": "Good socks, but note they are quite thick and warm", "location_and_date": "Reviewed in the United States on August 6, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07F282SF7", "text": "I have been trying to find ankle socks that covered my ankles with no luck until I found these, awesome!", "title": "Exactly what I'm looking for!", "location_and_date": "Reviewed in the United States on August 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "Not sure if they are snug on my feet because they are too small but it’s a secure snug fit that’s not too tight (size 15) the sock is overall comfortable and breathable", "title": "Nice", "location_and_date": "Reviewed in the United States on August 6, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07F282SF7", "text": "These socks are not only made out of nice soft material, the thickness seems about right - thick enough to be durable but not too thick so as to be hot.  The XL size was actually XL - imagine that! - so plenty of room for toes without slipping off my heel.  Time will tell how long they hold up, but so far so good.", "title": "Nice fit and comfy", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "Socks fit nice, feel nice, look nice, and are as described. Not much more to say!", "title": "Good purchase", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCPQ5W", "text": "Nobody wants to see that. Besides, it's preventable. Just wash them inside out before you wear them. I did, and no lint. I expected a little because that's what cotton socks do, but there was none.These are comfortable, low profile (visible with sneakers but inconspicuous), and most importantly, they don't get eaten by my shoe when walking. It's also great to find the extended size to wear with my size 15 sneakers.  I'd prefer a higher cotton content, but I suppose that would make the lint police even more upset.", "title": "Please stop posting photos of lint-covered toes", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCPQ5W", "text": "I wear size 12 so got the larger size; maybe should have gotten the next smaller ‘cause they show when wearing running or cycling shoes. I will try to see if they shrink some", "title": "Ok but not really “no show”", "location_and_date": "Reviewed in the United States on July 30, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07FCCPQ5W", "text": "These socks are not only made out of nice soft material, the thickness seems about right - thick enough to be durable but not too thick so as to be hot.  The XL size was actually XL - imagine that! - so plenty of room for toes without slipping off my heel.  Time will tell how long they hold up, but so far so good.", "title": "Comfy socks that are large enough", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCPQ5W", "text": "I walk 8-10 miles a day, so good socks are very important. I've had problems in the past with socks with not enough give, leading to stubbed toes and nail damage. These are very stretchy and comfortable. I've been wearing them a couple weeks, and have had no such issues. I'll buy them again.I'm a size 12 and bought the size 12-14 of the socks.", "title": "Stretchy and Comfortable", "location_and_date": "Reviewed in the United States on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCPQ5W", "text": "At first the elastic is tight but after 3 washing and dryer the elastic relaxed enough for them to be comfortable.  I don't know how durable they are since I just got them", "title": "time", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07FCCPQ5W", "text": "Felt good on my feet at a good price point", "title": "Great sock", "location_and_date": "Reviewed in the United States on August 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCPQ5W", "text": "Very comfortable and durable. Need to order more.", "title": "Great product", "location_and_date": "Reviewed in the United States on August 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCPQ5W", "text": "Nothing wrong with the product -- just did not work for me.  Stocking feet was a safety hazard on our hard wood floors.", "title": "Good product - but", "location_and_date": "Reviewed in the United States on July 30, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCPQ5W", "text": "Does as it should", "title": "Gift", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCPQ5W", "text": "I'm not picky about socks to be honest, but the stretch is nice on these and they are soft and comfortable.", "title": "Quality & Great Value", "location_and_date": "Reviewed in the United States on July 30, 2023", "verified": true, "rating": "5.0"}