[
{"asin": "B07Q4398F2", "text": "Socks are soft, and Comfortable, they are not Super Thick, and NOT THIN AT ALLi walk docks all day, used these in timberland PRO BOOTS(My Feet Were happy and DRY) All day.i Work on my feet ALL DAY! so having Great Comfortable Socks is Essential!im here leaving this comment and reivew for those dudes/vatos - who have a wide foot, want a nice sock, not too high, but still down and comfortable i use these for my every day wear now and Work attire.I WILL BE ORDERING MORE, In VARIOUS COLORS. GRACIAS-MERXZILLA", "title": "im a size 13(w) - 12-14(FITME) Always on My FEET!", "location_and_date": "Reviewed in the United States on August 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q4398F2", "text": "The Amazon Essentials Men's Cotton Half Cushioned Crew Socks are a practical and budget-friendly option for everyday wear. With their comfortable design, reliable quality, and multipack options, these socks are a convenient choice for men seeking affordable and reliable footwear.One of the standout features of these socks is their comfort. They are made from a soft and breathable cotton fabric that provides a comfortable and cozy feel on the feet. The half cushioning adds an extra layer of padding and support to the soles, enhancing comfort during extended periods of wear. The crew length design offers coverage and protection for the ankles, making them suitable for various types of footwear.The quality of the Amazon Essentials socks is reliable, especially considering their affordable price point. The socks are well-constructed and durable, ensuring they can withstand regular use and multiple washings without losing their shape or softness. The cotton fabric remains comfortable and does not pill excessively, maintaining a neat and tidy appearance over time. In conclusion, the Amazon Essentials Men's Cotton Half Cushioned Crew Socks are affordable and reliable everyday essentials that offer comfort and durability. Their soft cotton fabric, half cushioning, and multipack options make them a practical choice for men seeking comfortable socks without breaking the bank. Whether for casual or professional wear, these socks deliver on their promise of comfort and value.", "title": "Loved this product!!", "location_and_date": "Reviewed in the United States on July 13, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q4398F2", "text": "Needed new dress socks and came across these and...They're amazing!I never realized the difference a good thick sock can make it overall comfort, these were an eye opener! They weren't hot, they didn't bunch up and they were a great fit!", "title": "Very comfortable", "location_and_date": "Reviewed in the United States on August 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q4398F2", "text": "I know the world of socks can be vast but I'm a simple guy and I've only known your basic white sock, and as far as the basic white sock is concerned, this might just be the best quality for value. I'm genuinely impressed and cherish these socks above all my others... They're so soft and a perfect thickness, zero discomfort or tightness around the ankle. It's like putting a cloud on my foot.", "title": "Best socks I've ever owned...", "location_and_date": "Reviewed in the United States on August 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q4398F2", "text": "They are really good socks my husband loves them they don’t get wet or sweaty, he wears them for work all day everyday except the weekends.", "title": "Great", "location_and_date": "Reviewed in the United States on August 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q4398F2", "text": "These socks are good quality but they leave little black fuzz balls in our carpet & it drives me crazy because I feel like I’m constantly having to pick little black fuzzies out of the carpet or out of our bed. Also, when my husband takes these socks off, the bottoms of his feet & between his toes are covered in the black fuzzies too so when he gets in the shower, he leaves a trail of them. We probably won’t be repurchasing.", "title": "Good quality but piling does happen", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q4398F2", "text": "I bought them for my nephew. he really likes them, he said they are normal they feel good and they fit well he wears a size 8 regular means shoe. First time Washed them in cool water, dryer low heat 20minutes, then had to repeat dryer twice. Our dryer gets very very hot even on low. Do I did NOT want to shrink them first wash  & dry. Did not shrink.", "title": "Good socks", "location_and_date": "Reviewed in the United States on July 25, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q4398F2", "text": "I'm shoe size 11 and I first bought the large... too large.  The regular (6 - 12) was the right choice.  They're soft and appear well made.  After washing they fit perfectly.", "title": "Great price on nice socks", "location_and_date": "Reviewed in the United States on August 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q4398F2", "text": "After several washes still holds fit and form.", "title": "Form and fit", "location_and_date": "Reviewed in the United States on August 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q4398F2", "text": "I wear these socks for work in a physically active job and bought two 10-packs 3 years ago. I started noticing some were getting thin or wearing through on the balls of my feet or heel so I’m throwing some out and buying more. Good value", "title": "Bought 3 years ago, coming back for more.", "location_and_date": "Reviewed in the United States on July 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q43L4F2", "text": "I'm not kidding when I say these are the best socks I've ever bought. I'm talking about the grey heather size 6-12 ankle socks. Unfortunately, Amazon hasn't had these in stock for quite some time (or maybe they sell out right away?). Only the larger size, which I can't comment on. But for this size, it fits my feet perfectly (I wear size 10-10.5 shoes). Other socks in this size range are a little tight on my feet, but these go right on. The thickness is just right, they don't feel too thick but they aren't thin either. I don't get any stretching of the sock where your foot starts to show through the thin material, like you see in some socks.I've been using these pretty much every day for a year and a half, and in all 10 pairs I don't have any holes or fraying or anything like that. I wish I bought more than 10 pairs at the time because I've tried other socks since then (not to replace these, but to expand my wardrobe) and honestly, none have been as good as these. I don't know if the quality is the same across Amazon's other color choices, but I like the solid grey ankle socks so I'm out of luck unless these come back.", "title": "Best socks I've ever bought", "location_and_date": "Reviewed in the United States on August 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q43L4F2", "text": "These are a good value, very comfortable, and are very close to name brands as far as I can tell.  Will update review as I wear them for longevity, but I will absolutely buy them again over Hanes or Fruit of the Loom as things stand right now.", "title": "Better option than I was expecting", "location_and_date": "Reviewed in the United States on August 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q43L4F2", "text": "But still need more elastic Tight around ankles", "title": "Nice socks", "location_and_date": "Reviewed in the United States on August 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q43L4F2", "text": "I like the socks except all the lint. Gets everywhere, even after 2 washes", "title": "So much lint", "location_and_date": "Reviewed in the United States on July 24, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q43L4F2", "text": "Decently thick and soft, cheap, and comfortable. Exactly what I wanted!", "title": "Nice and comfy", "location_and_date": "Reviewed in the United States on August 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q43L4F2", "text": "Based on the price, I figured these socks would be like wearing thin sandpaper that would quickly disintegrate. I could not have been more pleasantly surprised. They are the precise opposite. They are thick, well-made, and soft. It feels like walking on fluffy clouds. It doesn't, but they're very comfortable, and when these do wear out (eventually....I don't think it will be any time soon.), I will be ordering more of these.", "title": "Great!", "location_and_date": "Reviewed in the United States on July 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q43L4F2", "text": "Purchased for my husband and he finds them comfortable", "title": "Just As Described", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q43L4F2", "text": "Very nice item", "title": "Good quality.", "location_and_date": "Reviewed in the United States on August 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q43L4F2", "text": "Muy bueno y cómodas", "title": "Excelente", "location_and_date": "Reviewed in the United States on August 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q43L4F2", "text": "Should have ordered a size smaller. They feel loose. They're still comfortable tho, and I like the colors.", "title": "Big", "location_and_date": "Reviewed in the United States on July 1, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q8JGDRC", "text": "my grandson is 6'5\" and has big feet. regular socks are too small. I bought these for him and he said they are great and long enough for his xlarge feet", "title": "large enough", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "So I’ve always wore these Nike ankle socks like these they were new and always had an issue with falling apart and just getting holes; I bought these bad boys and they’re soft, so comfortable, and have like a tad bit of padding that makes them feel just great. I’m definitely buying these socks again in the future, the material is just so good for the price and all.", "title": "Amazing Amazon socks", "location_and_date": "Reviewed in the United States on June 25, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "Awesome socks. Very soft and comfortable to wear. No sweating.", "title": "Awesome socks", "location_and_date": "Reviewed in the United States on July 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "Exceptional wear, best I have experienced in this type of sock.", "title": "Exactly as described.", "location_and_date": "Reviewed in the United States on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "A good durable sock but it seems a little large.", "title": "Run a bit large", "location_and_date": "Reviewed in the United States on June 15, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q8JGDRC", "text": "Title says it all", "title": "I bought them oversized and am very happy with them.", "location_and_date": "Reviewed in the United States on July 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "Fit my husbands wide feet AND high instep!", "title": "Fit my husbands XXWide feet.", "location_and_date": "Reviewed in the United States on May 28, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q8JGDRC", "text": "I wear a size 12 shoes, and these socks don't fit right.", "title": "Sock is too big.", "location_and_date": "Reviewed in the United States on May 19, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07Q8JGDRC", "text": "the occasional blue sock day was fun", "title": "does the job and i liked the color option", "location_and_date": "Reviewed in the United States on July 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07Q8JGDRC", "text": "would buy again.", "title": "Nice, comfy and sweat absorbent.", "location_and_date": "Reviewed in the United States on May 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07F2N8DF5", "text": "My son is in socks or bare feet all the time and these socks have held up great.He runs around in the grass in socks and they are holding up well without piling or getting holes. I waited several months before reviewing to see how they'd hold up and I'm very pleased with them.He says they are comfy and they stretch and don't hurt his legs but they also have not stretched so much that they fall down and again, we've had them several months now.Will buy again.", "title": "Great for an ative teen!", "location_and_date": "Reviewed in the United States on August 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F2N8DF5", "text": "These socks are just the right size for my size 8 foot; The last batch I bought from hanes were huge; these hug without squeezing too much I think if you have a wide size 11 they may not work, but there 's another inch or 2 for those with larger feet.", "title": "My new favorite socks", "location_and_date": "Reviewed in the United States on July 24, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07F2N8DF5", "text": "These socks are soft, elastic in all aspects of the sock, and very comfortable. Best workout socks I’ve ever worn. One advisory, they should be washed in cold water.", "title": "Better than advertised", "location_and_date": "Reviewed in the United States on August 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F2N8DF5", "text": "I purchased these twice, they are very narrow or tight for the size they are claiming, I have size 10 and bought the size 6-12 and they were just way to tight, returned for the next size up 12-14 and they are still tight, I have to roll them down and thread them on to my feet. Once on they are however quite soft and medium cushy, the tightness will not kill my feet or stop the blood-circulation or anything, but I will not have them all the way up on the calf, too tight for comfort with these socks, not a problem for me since I never wear any socks that way, I always pull the socks up on my feet and then push the excess sock down the ankles. So if I wear them like that I found them to be acceptable for the price. But if you have big feet or big calf's, these are not for you, I would say that if you are a normal10, the size 12-14 might work for you, above that or wide, you will probably have to return them.", "title": "Comfy to a point.", "location_and_date": "Reviewed in the United States on May 8, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07F2N8DF5", "text": "On time and as promised, good fit, stretched perfectly. Good Buy.", "title": "Lightweight for summer", "location_and_date": "Reviewed in the United States on August 1, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07F2N8DF5", "text": "The socks fit great, and are soft. Very happy with them.", "title": "This is excellent", "location_and_date": "Reviewed in the United States on August 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F2N8DF5", "text": "I had no problems", "title": "Fingers went smooth", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F2N8DF5", "text": "Yup ...", "title": "Great socks", "location_and_date": "Reviewed in the United States on August 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F2N8DF5", "text": "Just what i was hoping for.", "title": "Great product", "location_and_date": "Reviewed in the United States on August 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F2N8DF5", "text": "Good one", "title": "Good", "location_and_date": "Reviewed in the United States on August 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "I wear this type of sock daily with work shoes/boots working on houses.  These were recommended by Amazon when i was looking to purchase some more work socks. These are very comfortable and durable. These could be worn with tennis shoes for comfort as well.  i will order more as needed.", "title": "Comfortable and Durable", "location_and_date": "Reviewed in the United States on August 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "Good quality socks.  They didn't fit as expected as I  have long feet.They were too short for me even though I  chose Men's extra large.", "title": "Socks", "location_and_date": "Reviewed in the United States on August 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07F282SF7", "text": "Affordable and good quality sock. Feels comparable to major sports brands like adidas and nikeI wears these for anything and everything. I wear them when working in the hospital, working out in the gym, and when playing soccer. I have had no issues with them. They are a secure fit and don't not slide down at the heel.", "title": "Great quality sock", "location_and_date": "Reviewed in the United States on August 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "I fully expected these to be low quality and that I would be returning them.  After all store brands are almost always the lowest quality.  Well I'm wrong in this case.  They fit well and are comfortable and seem very durable.  I'd buy them again.", "title": "Better Than I expected", "location_and_date": "Reviewed in the United States on August 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "I like these better than another brand I have used. They are still sized right after one washing, whereas the others shrunk up a bit to make them tight. They are just the way I wanted them to be.", "title": "Comfortable not too tight.", "location_and_date": "Reviewed in the United States on August 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "Good socks with a tight fit. Warmer than I expected.The first couple of uses some fibers were left on my fit when taking them off.Overall I like them, but would prefer a little thinner fabric.", "title": "Good socks, but note they are quite thick and warm", "location_and_date": "Reviewed in the United States on August 6, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07F282SF7", "text": "I have been trying to find ankle socks that covered my ankles with no luck until I found these, awesome!", "title": "Exactly what I'm looking for!", "location_and_date": "Reviewed in the United States on August 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "Not sure if they are snug on my feet because they are too small but it’s a secure snug fit that’s not too tight (size 15) the sock is overall comfortable and breathable", "title": "Nice", "location_and_date": "Reviewed in the United States on August 6, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07F282SF7", "text": "These socks are not only made out of nice soft material, the thickness seems about right - thick enough to be durable but not too thick so as to be hot.  The XL size was actually XL - imagine that! - so plenty of room for toes without slipping off my heel.  Time will tell how long they hold up, but so far so good.", "title": "Nice fit and comfy", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07F282SF7", "text": "Socks fit nice, feel nice, look nice, and are as described. Not much more to say!", "title": "Good purchase", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCVB7R", "text": "Nobody wants to see that. Besides, it's preventable. Just wash them inside out before you wear them. I did, and no lint. I expected a little because that's what cotton socks do, but there was none.These are comfortable, low profile (visible with sneakers but inconspicuous), and most importantly, they don't get eaten by my shoe when walking. It's also great to find the extended size to wear with my size 15 sneakers.  I'd prefer a higher cotton content, but I suppose that would make the lint police even more upset.", "title": "Please stop posting photos of lint-covered toes", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCVB7R", "text": "I wear size 12 so got the larger size; maybe should have gotten the next smaller ‘cause they show when wearing running or cycling shoes. I will try to see if they shrink some", "title": "Ok but not really “no show”", "location_and_date": "Reviewed in the United States on July 30, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07FCCVB7R", "text": "These socks are not only made out of nice soft material, the thickness seems about right - thick enough to be durable but not too thick so as to be hot.  The XL size was actually XL - imagine that! - so plenty of room for toes without slipping off my heel.  Time will tell how long they hold up, but so far so good.", "title": "Comfy socks that are large enough", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCB3FL6", "text": "I walk 8-10 miles a day, so good socks are very important. I've had problems in the past with socks with not enough give, leading to stubbed toes and nail damage. These are very stretchy and comfortable. I've been wearing them a couple weeks, and have had no such issues. I'll buy them again.I'm a size 12 and bought the size 12-14 of the socks.", "title": "Stretchy and Comfortable", "location_and_date": "Reviewed in the United States on July 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCVB7R", "text": "At first the elastic is tight but after 3 washing and dryer the elastic relaxed enough for them to be comfortable.  I don't know how durable they are since I just got them", "title": "time", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07FCCVB7R", "text": "Felt good on my feet at a good price point", "title": "Great sock", "location_and_date": "Reviewed in the United States on August 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCVB7R", "text": "Very comfortable and durable. Need to order more.", "title": "Great product", "location_and_date": "Reviewed in the United States on August 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCB3FL6", "text": "Nothing wrong with the product -- just did not work for me.  Stocking feet was a safety hazard on our hard wood floors.", "title": "Good product - but", "location_and_date": "Reviewed in the United States on July 30, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCB3FL6", "text": "Does as it should", "title": "Gift", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCB3FL6", "text": "I'm not picky about socks to be honest, but the stretch is nice on these and they are soft and comfortable.", "title": "Quality & Great Value", "location_and_date": "Reviewed in the United States on July 30, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K76RRH", "text": "I like how they fit and the bottoms have a nice cushion", "title": "very nice and comfortable", "location_and_date": "Reviewed in the United States on August 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K76RRH", "text": "Medias para mujer de gran calidad. Excelentes materiales. Muy cómodas.", "title": "Excelente Producto", "location_and_date": "Reviewed in the United States on August 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K76RRH", "text": "Really good quality socks.  Very pleased with fit and softness.  Will purchase again.", "title": "Nice Socks", "location_and_date": "Reviewed in the United States on August 1, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCT5QW", "text": "It's definitely hard to find a nice pair of crew height socks recently.  I prefer as much cotton as possible and still have some give to them.  These are soft, easy to get on (enough stretch) and don't leave marks all over my ankles.  Thank you for them.", "title": "Nice Socks", "location_and_date": "Reviewed in the United States on August 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K76RRH", "text": "These are my new favorite socks.  I've had them for quite some time now and they are comfortable and I like the colors on the toes and heals. They stretch fairly well although I could use a little more stretch above the ankles but regardless, I love these socks and would recommend them to others with larger feet.", "title": "Comfy socks for larger feet", "location_and_date": "Reviewed in the United States on June 19, 2023", "verified": true, "rating": "4.0"},
{"asin": "B096K76RRH", "text": "Worth the money . Very comfortable", "title": "Very good socks .", "location_and_date": "Reviewed in the United States on July 29, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCT5QW", "text": "I have been looking for socks like these for years.  They are actually crew socks not the ones that shrink and cover your ankle.  They stay in places and the colors are beautiful.", "title": "Extremely comfortable actually crew socks", "location_and_date": "Reviewed in the United States on August 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCT5QW", "text": "So soft and comfortable. Love my new socks", "title": "The comforter of this product", "location_and_date": "Reviewed in the United States on August 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K76RRH", "text": "These socks actually feel very good -- socks are usually neutral or unpleasant but these really are very comfortable.  I wear shoe size 10, these are size 8-12, they'd be tight on an 11-12 foot I think. I would buy these again.", "title": "Feel good on my feet, well made, wash/dry well", "location_and_date": "Reviewed in the United States on July 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K76RRH", "text": "comfortable, good quality", "title": "awesome fit and comfort", "location_and_date": "Reviewed in the United States on July 24, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCT5QW", "text": "I like the socks very much comfortable", "title": "Socks", "location_and_date": "Reviewed in the United States on August 1, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCT5QW", "text": "They've stretched and one had a hole after one use. Okay if you're looking for cheap socks that are cute.", "title": "Cute socks", "location_and_date": "Reviewed in the United States on June 7, 2023", "verified": true, "rating": "4.0"},
{"asin": "B096K76RRH", "text": "I just ordered these and love the socks. They just don't fit.", "title": "Feel great, just to big.", "location_and_date": "Reviewed in the United States on June 26, 2023", "verified": true, "rating": "4.0"},
{"asin": "B096K76RRH", "text": "These socks are the most comfortable I have worn.  I have a LG and wide foot they fit beautifully", "title": "Comfortable", "location_and_date": "Reviewed in the United States on July 1, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCT5QW", "text": "I've been always looking for 100% cotton socks and here it is.Very comfortable and feel that my feet can breathe.  Slightly too large for small feet like 5 1/2.", "title": "Very comfortable, healthy and feet can breathe.", "location_and_date": "Reviewed in the United States on June 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCT5QW", "text": "I don't have fat calves nor to I retain water.  What I have noticed over the years that socks have become tighter leaving marks from the elastic imprinted in your skin.  I now have 2 dozen socks that I will not wear because of the tightness.  Ive also tried socks for diabetic and they simply slide down.  So I searched on Amazon instead and though to give these a try.  They are wonderful with a lot of flex and they are not tight at all.  They also provide good space around the toes.  Love them and will buy another set.", "title": "Comfy and not tight", "location_and_date": "Reviewed in the United States on May 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B096K76RRH", "text": "I always buy Socks From Amazon. But this Time, I am Not Happy, the colors are Great, but the Sizing is All Wrong. They are Too Small for My Feet. I was wearing a Size 7 Shoe. They should have FIT.", "title": "Ladies Socks", "location_and_date": "Reviewed in the United States on May 12, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07FCCT5QW", "text": "These socks are plain black socks, fit true to size, feel comfortable on my feet, just enough stretch in them without being too much stretch so they stay up nicely without feeling too tight after wearing them for a few hours, machine wash and dry nicely....what else can I say about socks? Perhaps one of the best thing about these socks is the TEN pairs for a truly great price so that I was able to share them with my husband, now we each have five new pairs of black \"everyday socks\" which we can wear with almost everything and he does not have to do the laundry until the end of the week", "title": "Good price for good socks!", "location_and_date": "Reviewed in the United States on March 9, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07FCCT5QW", "text": "These are nice little socks for spring boots. Cute and comfy but not too bulky…", "title": "Nice socks", "location_and_date": "Reviewed in the United States on June 28, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCT5QW", "text": "Cómodos y calientitos. Fáciles de lavar.", "title": "Calientitos", "location_and_date": "Reviewed in the United States on June 29, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCDSY7T", "text": "I love how soft these socks feel.  They wash well and dry well!", "title": "All-cotton socks that function and wash well are always wonderful!", "location_and_date": "Reviewed in the United States on August 1, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCDSY7T", "text": "What can you say about socks?  The sizing was right. I enjoyed the colors. The price seemed right. Because sock gremlins regularly est socks, I imagine I will need to order again at some time", "title": "Great socks", "location_and_date": "Reviewed in the United States on July 1, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCDSY7T", "text": "Love the large size. The socks washed great, and are so comfortable.", "title": "Most comfortable socks.", "location_and_date": "Reviewed in the United States on July 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCDSY7T", "text": "Comfy", "title": "Nice", "location_and_date": "Reviewed in the United States on June 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07FCDSY7T", "text": "Nice thickness and fit.", "title": "Nice", "location_and_date": "Reviewed in the United States on June 2, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07FCDSY7T", "text": "Súper buena calidad", "title": "Nice", "location_and_date": "Reviewed in the United States on July 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCCT5X3", "text": "I am a true womens 8 and found these to be a bit big. They go up to mid ankle bone when pulled on.", "title": "A little big", "location_and_date": "Reviewed in the United States on April 23, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07FCDSY7T", "text": "These are nice thick no show socks that goes well with sneakers and boots.The thickness adds a bit of cushioning and the low cut pairs well with dark colored sneakers.I also discovered that I like wearing these with my boots. I tend to size up my boots and the thickness not only adds cushion but also prevents my feet from sliding around the boots like they did with some thinner socks. In the past I tend to favor ankle or even calf length thick socks under my boots, but these actually gave me more room in the ankle area and provide more flexibility when walking, if that makes sense.My favorite part is that unlike some socks with different color logos on each pair, I got the entire pack in black, it’s much easier to sort after doing laundry. Just order two more packs in plain black, this should easily last me through this winter.Fair warning, the first time wearing these, you’ll see a lot of black fuzz left on your toes. I didn’t mind too much as that wasn’t a recurring issue.", "title": "Great value pack", "location_and_date": "Reviewed in the United States on December 10, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07FCDSY7T", "text": "Comfortable, colorful and breathable socks.", "title": "Real comfortable socks!", "location_and_date": "Reviewed in the United States on June 24, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07FCDSY7T", "text": "Update: I wanted these to be perfect, but they just don't stay put on my feat. Even in shoes the heel migrates on my foot.  They might work for some, so only took off one star.First review: I have had a very hard time finding an old-style cotton ankle-height sock. This is the one. No elastic girdle squeezing my feet that is supposed to be an arch support. Mostly cotton rather than hot, wierd-feeling fake stuff. Just the right thickness too.", "title": "After wearing had to edit/remove a star (Great cotton socks)", "location_and_date": "Reviewed in the United States on February 16, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09YF4FF9H", "text": "These socks are wonderful! They're well made and thicker than the average athletic sock not by much, but enough to make a difference.  The size is precise.  The elastic around the crew area is not too tight.And does not shrink with washing.", "title": "Great athlete socks", "location_and_date": "Reviewed in the United States on August 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4FF9H", "text": "Nice comfy socks, just a little overpriced in my opinion. They seem durable and good quality though so I guess the price is worth it!", "title": "Comfy", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09YF4FF9H", "text": "These socks are super soft, have a little padding on the sole and don't squeeze the life out of my ankles. The colors are exactly as shown and add a nice way to easily match the socks up after washing.", "title": "Very soft and comfortable", "location_and_date": "Reviewed in the United States on July 28, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4FF9H", "text": "Wife loved them. Couldn’t wait to try on a pair. Very happy with purchase.", "title": "Cloth blend exactly right", "location_and_date": "Reviewed in the United States on August 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4FF9H", "text": "Good socks, Comfortable,just what She wanted", "title": "Good Socks", "location_and_date": "Reviewed in the United States on July 1, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09YF4FF9H", "text": "I am well pleased with these socks", "title": "Good deal", "location_and_date": "Reviewed in the United States on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4FF9H", "text": "They are sized a bit small and are pretty snug in the leg. I don't usually have issues with socks, I assume I'm pretty average. I wear a size 9 - 9.5 shoe.", "title": "Snug", "location_and_date": "Reviewed in the United States on May 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09YF4FF9H", "text": "Comfortable and soft socks. However I would not expect anything in support from these.", "title": "Comfortable", "location_and_date": "Reviewed in the United States on July 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4FF9H", "text": "These are a good value. There comfortable and pretty thick", "title": "Socks", "location_and_date": "Reviewed in the United States on July 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4FF9H", "text": "They feel good to wear. Very soft and comfortable, and nice fit around the arch. Like the colors as well.One caution I am finding is that they shed, even after washing. At first I thought it was extra material and would go away, but I find fibers stuck to my toes every time I remove them, and left on carpet or such. Still hoping they will eventually go away, but I probably won't buy this again because of the shedding.", "title": "Very soft and comfortable.", "location_and_date": "Reviewed in the United States on March 22, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09YF4YQKX", "text": "These seem very nice and a nice thickness although I would like thicker. I got the \"white, 8-12\" and I like the pastel colors on the heels and toes.  They are too large for me, but I wear a small size shoe between 5 and 6 so guess I'll have to look into child's socks, which I sometimes have to do for shoes too.  So, I wasn't surprised they were large on me but was hoping they would work. Am returning but not because of the product.", "title": "NICE ASSORTMENT", "location_and_date": "Reviewed in the United States on August 16, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09YF4YQKX", "text": "Extremely comfortable socks! Make sure to get the right size, the 9-11 size is large and roomy for a sz 9, so get the smaller size for fit.I’ve bought these for several yrs now,great!", "title": "I love these", "location_and_date": "Reviewed in the United States on August 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4YQKX", "text": "Love these socks and apparently so does our youngest granddaughter - they go home with her and I never see them again lol", "title": "Women’s socks", "location_and_date": "Reviewed in the United States on August 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4YQKX", "text": "These cotton athletic socks are very comfortable, fit well, and are a good buy for the money", "title": "Comfortable athletic socks", "location_and_date": "Reviewed in the United States on August 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4YQKX", "text": "Socks were high quality and material is soft.  I have previously purchased Nike, Under Amour, Saucony but got tired of them wearing out fast and turning gray.  I will be buying more of this brand.", "title": "Good quality socks", "location_and_date": "Reviewed in the United States on July 28, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4YQKX", "text": "Very well made, love the look of them, comfortable", "title": "Love these socks!", "location_and_date": "Reviewed in the United States on August 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B08PF2PL5X", "text": "Cotton ladies sock are great", "title": "Ladies socks", "location_and_date": "Reviewed in the United States on August 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4YQKX", "text": "Cotton socks that don’t mess with circulation", "title": "Made of cotton", "location_and_date": "Reviewed in the United States on July 29, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09YF4YQKX", "text": "Bought for my sister to go with her new tennis shoes. Loves them.", "title": "Just what we needed. . .", "location_and_date": "Reviewed in the United States on August 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YF4YQKX", "text": "They are thick, but not too thick. Perfect height on the ankle for my steel toe ankle boots. I'm on my feet on a concrete floor for 10-12 hrs a day and these are the most comfortable socks I've owned. I can't feel the seam and my feet do not sweat in these. Holding up well and no lint when I take them off.", "title": "Perfect", "location_and_date": "Reviewed in the United States on July 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0BRK8ZN77", "text": "These socks are great. They're comfortable, soft, thick enough for exercise comfort. My only issue is that I only received one of the teal colored socks so I ended up with five pairs instead of six. I guess I can use it as an alternate but seeing as how there is only one pair of the teal, it won't match. Other than that, totally happy with these socks!", "title": "Great socks but missing one sock", "location_and_date": "Reviewed in the United States on August 1, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0BRK8ZN77", "text": "My feet are a true size 7. These socks are too big for me and my feet just slide around in them. I can only wear them with specific shoes because there is too much sock fabric that pushes up around my ankles in tighter shoes like my Converse but they work ok in boots. I like them for around the house. The padding in them is great.", "title": "Very average", "location_and_date": "Reviewed in the United States on July 13, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0BRK8ZN77", "text": "The quality of these socks exceeded my expectations.  Will buy again.", "title": "Great Quality", "location_and_date": "Reviewed in the United States on August 2, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0BRK8ZN77", "text": "These are soft and comfortable, fit well and just what I needed after foot surgery.", "title": "Just what I needed", "location_and_date": "Reviewed in the United States on July 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0BRK8ZN77", "text": "I thought I would try the Amazon Basics version of ankle cotton socks.  They are very cosy and soft, the design is pleasing, I actually love them.  However, they run large.  The size was 8-12 which is a generic standard size for most socks.  Instead it was closer to size11.  So there is extra fabric at the back of the sock.But they were so comfortable, I decided to keep them.  But, 'warning' they run large!", "title": "RE: Great, cushy socks a tad large", "location_and_date": "Reviewed in the United States on April 28, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0BRK8ZN77", "text": "Love the arch support.", "title": "Great socks", "location_and_date": "Reviewed in the United States on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0BRK8ZN77", "text": "Good socks. No issues.", "title": "Comfortable", "location_and_date": "Reviewed in the United States on July 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0BRK8ZN77", "text": "These socks are comfortable and cushioned. They don’t cut off my circulation like a previous purchase with a different brand", "title": "Great socks", "location_and_date": "Reviewed in the United States on June 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09YFQ64VF", "text": "Nice socks. They’re definitely going to last and they offer good support. Just a little big on me.", "title": "Ran a little large (size 7)", "location_and_date": "Reviewed in the United States on April 1, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0BRK8ZN77", "text": "The 2 horizontal stripe version of these Amazon ankle socks are awesome. For at wlast year, they seem to be unavailable and the new three stripe version is not the same. The new socks are a couple inches too long and thinner. I don't like them. I really want to purchase the older version.", "title": "The socks changed", "location_and_date": "Reviewed in the United States on April 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SCK3NY", "text": "I love these little socks. The elastic around the ankle is more \"Spread out\", covering about an inch instead of a single band of elastic like with the Hanes I've used in the past that would leave a deep red indent in my skin come the end of the workday. The arch is extremely comfortable, the toe doesn't constrict. Great set of socks, and I probably won't ever go back.", "title": "Better than Hanes", "location_and_date": "Reviewed in the United States on August 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SCK3NY", "text": "Elevate your athletic performance with Amazon Essentials Men's Performance Zone Cushion Athletic Tab Socks. This pack of 6 pairs provides targeted support and impact absorption, ensuring comfort and reducing the risk of blisters during high-intensity activities. The tab design offers a secure fit, while the moisture-wicking properties keep your feet dry and comfortable. With their durability and stylish design, these socks are a must-have for any active individual. Step up your game with Amazon Essentials Men's Performance Zone Cushion Athletic Tab Socks!", "title": "Step Up Your Performance with Amazon Essentials Men's Performance Zone Cushion Athletic Tab Socks!", "location_and_date": "Reviewed in the United States on July 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SCK3NY", "text": "slightly better than the rest", "title": "nice extra ankle support", "location_and_date": "Reviewed in the United States on June 6, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0B5SCK3NY", "text": "Fit well on my size 14 feet. Good cushioning.Reasonable price for the quality.", "title": "Good Fit, Comfort, Price", "location_and_date": "Reviewed in the United States on July 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SCK3NY", "text": "These feel thin and cheep.  They're falling apart with each wash and I can feel the woven-in elastic break every time I put them on.  I mean, they're cheap socks so I got what I paid for, but next time I'd definitely buy something else", "title": "Thin and cheep", "location_and_date": "Reviewed in the United States on July 6, 2023", "verified": true, "rating": "3.0"},
{"asin": "B0B5SCK3NY", "text": "I am a big fan of Amazon essentials. Great prices good quality. Husband loves his new socks.", "title": "Best price, good socks", "location_and_date": "Reviewed in the United States on June 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SCK3NY", "text": "These socks are just OK.  I opted for the largest 12-14 size since I wear 13, and sometimes 14 depending on the shoe type.  These BARELY fit my foot---they JUST make it over my heal with almost nothing left to pull up towards my ankle--have to pull extremely hard on the sock to get it on.  I've worn both the black and white styles several times and they are pretty cushy on the bottom, but they seem to want to ride down the back of my heal, and it starts to rub on the actual shoe after a few hours.  They need to be a good 1/2 inch to an inch bigger to advertise as a size 14.", "title": "Almost didn't fit", "location_and_date": "Reviewed in the United States on July 27, 2023", "verified": true, "rating": "2.0"},
{"asin": "B0B5SCK3NY", "text": "Great look and feel.  Glad I purchased", "title": "I ordered the larger size", "location_and_date": "Reviewed in the United States on June 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SCK3NY", "text": "For the price I wasn’t expecting much, but I’m very happy with the fit and comfort of these socks. I plan on buying more.", "title": "Better than expected", "location_and_date": "Reviewed in the United States on May 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SCK3NY", "text": "THEY ARE AWESOME! I RECOMMEND THIS PRODUCT.", "title": "THEY LOOK GOOD TOO!", "location_and_date": "Reviewed in the United States on May 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SD4VSD", "text": "These are nice but too big. If I buy again, I would size down. I wear 7 1/2 in shoes and have a normal width.", "title": "Too long for me", "location_and_date": "Reviewed in the United States on July 11, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0B5SD4VSD", "text": "I bought the Amazon brand socks and they are much nicer and thicker than I expected! It won't be the last time I buy these, I have been purchasing more and more of the Amazon brand for just about everything,  clothes, household cleaning supplies, personal care, ect. and I have yet to be disappointed. Thank you Amazon for helping me get by on a fixed income in this insanely and prohibitively expensive economy today. If it were not for your brands being fairly priced I would be doing without many more things than I already am.", "title": "Pleasant surprise", "location_and_date": "Reviewed in the United States on June 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SD4VSD", "text": "Not great quality and run a little large", "title": "Poor quality", "location_and_date": "Reviewed in the United States on March 14, 2023", "verified": true, "rating": "3.0"},
{"asin": "B0B5SD4VSD", "text": "I am a size 11 in men shoes and these fit perfectly! My favorite part of them is the comfiness of them its like slipping into clouds!", "title": "Overall comfy socks", "location_and_date": "Reviewed in the United States on April 13, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0B5SD4VSD", "text": "These are great socks, and offer a great deal.They fit as expected, and stay on as well as any name brand. They have good cushioning on the heels and toes, which will probably help them last longer. They're breathable, keeping my feet nice and cool.I wash these normally, and dry medium heat with no issues.", "title": "Great Value for Good Socks", "location_and_date": "Reviewed in the United States on April 9, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0B5SD4VSD", "text": "These are pretty good socks but I wasn't wowed by them. Maybe I'm spoiled by more cushiony socks with protective silicone on the heels. These came up empty in both departments, though to be fair, there is extra cushioning in the toes and heels - just not as much as I'd like. The sole of the sock was loose fitting - which can be a bit uncomfortable when it shifts around in slippers or shoes. Even though I ordered the 6-9, these seemed a bit large for my 8.5 - 9 sized feet. On the plus side, these socks wash and wear well. I believe they will last well also. All in all, not bad for the price, but unless you have particularly wide feet, I'd size down when ordering.", "title": "Seemed a Bit Large", "location_and_date": "Reviewed in the United States on February 23, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0B5SD4VSD", "text": "Thin cushion. And the fabric pills.", "title": "Disappointing", "location_and_date": "Reviewed in the United States on June 7, 2023", "verified": true, "rating": "1.0"},
{"asin": "B0B5SD4VSD", "text": "I really like the padding in the heels and toes of these socks, and the tabs work great with tennis shoes. I like white footies, but the small stripes of color add a nice touch. I like the different zones of weaving in these socks with that nice snug band around the middle arch of the foot. I walk my dog on all the nice weather days and I was tired of my tennis shoes eating my footies.  The tabs on the back of these socks keep them right in place no matter how far we walk. I live in sock feet when I'm home and these little treasures work with anything you may be wearing from PJs to jeans to shorts, leggings or skirts. The are soft, comfortable and nice-looking socks at good value. What more could you ask for.", "title": "Comfortable and nicely made.", "location_and_date": "Reviewed in the United States on February 8, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0B5SD4VSD", "text": "First off, I appreciate that Amazon Essential's offers the larger 8-12 range instead of just the standard one size fits all.  I am a size 10, but I have wide feet.  I always struggle to find decent socks that adequately fit me without being too short.  I started buying mens socks during COVID so I'd be sure they'd be long enough and slip off.  When I first received these socks I thought they looked long, which is great news for me.  Once I put them on, they aren't as long as I expected.  My feet fill them up very well.  I don't see a size 11 or 12 being able to fit these socks.  Maybe a narrow size 11, but no way a size 12 would comfortable fit these without them sliding off.  I hope they dont shrink too much when I was them.  Other than the fit, they are comfortable, and I like the tab on the ankle.  I wish they came in a pack of all black instead of 3 black and 3 white.", "title": "Comfortable", "location_and_date": "Reviewed in the United States on January 30, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0B5SD4VSD", "text": "Socks arrived stained brown", "title": "Stained", "location_and_date": "Reviewed in the United States on April 9, 2023", "verified": true, "rating": "1.0"},
{"asin": "B097HYNC9W", "text": "I bought a set of compression socks at another brick and mortar retailer and those were okay, but I wanted something with a better fit and feel, and these do the job nicely. I seldom think about them during the day whereas the other ones kind of reminded me they were there. Well made and good looking.", "title": "Comfortable and not too tight", "location_and_date": "Reviewed in the United States on August 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "B097HYNC9W", "text": "After trying the first six pair that I bought, I liked them so much that I bought six more.  Then I bought another six pair so I can have a full weeks' worth at each of our houses.", "title": "These are great ... and affordable too!", "location_and_date": "Reviewed in the United States on August 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B097J3MFBS", "text": "I usually hate very thin socks, but these are comfortable and sturdy. Bought for an upcoming international trip that will involve a lot of walking, hopefully they stand up to heavy use.", "title": "Comfortable", "location_and_date": "Reviewed in the United States on August 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B097HYNC9W", "text": "I'm a heavy guy and have gotten into running a lot. This puts a lot of strain on my calves and achilles. I wear these during the day at work (business casual setting) and they don't look bad at all. The gentle compression helps keep my calves from getting to sore/crampy.", "title": "Nice pressure, durable", "location_and_date": "Reviewed in the United States on August 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B097HYNC9W", "text": "I weak compression stockings due to swelling and fluid collection in my lower legs.  I have one knee replacement, and if I don't wear compression stockings the knee swells, get's stiff and hurts.I've traditionally used Dr. Scholl's stockings and have had good luck with them.. about the right compression, and an enlarged toe area to keep from squeezing the toes too much.These stockings are what I would call a mild compression--less than the Dr. Scholls. However, they are thicker, more comfortable, and have the stylish red stripe up both sides.  And, they seem to be doing the job for me.", "title": "Comfortable and stylish, but compression is lower than expected.", "location_and_date": "Reviewed in the United States on July 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B097HYNC9W", "text": "I bought these compression socks along with a installer device. The socks are light weight and the installer made them easy to put on!", "title": "Light weight and easy to put on!!", "location_and_date": "Reviewed in the United States on August 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B097J3MFBS", "text": "Product meets my needs", "title": "Product meets description", "location_and_date": "Reviewed in the United States on August 4, 2023", "verified": true, "rating": "4.0"},
{"asin": "B097J3MFBS", "text": "My hubby wasn't expecting these. I've told him for years he needs to wear them. I wear something similar but for women. I decided he didn't know what he was missing so I purchased these. Not only do they help with tired legs, but with his bulging veins. They are also warm in our winter weather here in the mountains of NC. Good purchase. He will likely be getting more for Christmas.", "title": "Hubby Loves Them!! No More Tired Legs!", "location_and_date": "Reviewed in the United States on July 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B097J3MFBS", "text": "Bought these for my fiancé and he loves them", "title": "Great o er the calf compression socks", "location_and_date": "Reviewed in the United States on August 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B097HYNC9W", "text": "These are very comfortable! Great price for what you get !", "title": "Comfortable", "location_and_date": "Reviewed in the United States on August 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YNFB1", "text": "Buy them, comfortable, provide good protection and fits perfectly.", "title": "Very good!", "location_and_date": "Reviewed in the United States on July 24, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YNFB1", "text": "These are good, comfortable, well-made socks that you'll probably enjoy wearing.  That said, they're not really what I would call a \"hiking sock.\"  They are a bit thin for hiking, with one caveat:  On a real serious hike, usually involving mountains and a backpack, I generally wear two pair of socks (and my feet are glad I do).  These would work well for the thin sock closest to your feet, with another heavier pair worn over them.But if you just want some good socks to wear for work, school, or evenings out, these would probably work just fine.", "title": "Not What I'd Call a \"Hiking Sock\"", "location_and_date": "Reviewed in the United States on July 21, 2022", "verified": true, "rating": "4.0"},
{"asin": "B09K4YNFB1", "text": "I purchased a 'hiking' sock for working on my feet all day long in the cold. At first they seemed perfect, but things quickly \"unraveled\" from there . 'Amazon Essentials' really is starting to feel like their version of 'Good Value' down to the product quality. First impression was nice, as they fit perfectly and appeared to be quite thick, warm and comfortable and they vastly improved the work over thinner socks. Sadly, after just a couple uses, some of the socks began tearing and like all socks, holes began to appear. This was shocking to me, as the quality appeared to be quite nice. Surely I put them to heavy use, but they've fallen apart far quicker than other socks I've owned and certainly much faster than I expected.", "title": "Comfy but delicate.", "location_and_date": "Reviewed in the United States on January 22, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09K4YNFB1", "text": "Some pilling after just a few washes but overall a good sock that keeps my feet comfy in my safety shoes.", "title": "Good socks", "location_and_date": "Reviewed in the United States on November 30, 2022", "verified": true, "rating": "4.0"},
{"asin": "B09K4YNFB1", "text": "I bought these socks five months ago.  Each pair gets worn once or twice a week on a daily hike up to five miles.  The socks look almost new.  They fit my size 13 feet perfectly.", "title": "Surprisingly good quality", "location_and_date": "Reviewed in the United States on February 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YNFB1", "text": "The extra cushioning in the heel and toe area.", "title": "Cushioning in the heel", "location_and_date": "Reviewed in the United States on March 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YNFB1", "text": "Exceptional quality , fit and comfort.  Would recommend.", "title": "Excellent value", "location_and_date": "Reviewed in the United States on March 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YNFB1", "text": "Nice socks, good material, but too tight. I have long and narrow feet, and the socks were snug. However, the material was elastic enough to accommodate them. Good for the price.", "title": "Tight", "location_and_date": "Reviewed in the United States on August 5, 2022", "verified": true, "rating": "3.0"},
{"asin": "B09K4YNFB1", "text": "Three pairs of socks with a nicely cushioned bottom of the foot and a rather thin top of the foot.  These are great for everyday walking around, but just didn't feel cushioned enough overall for distance hiking.  They did fit into shoes of the normal size without making them feel too tight.The socks are about 9\" long from the floor to the top of the cuff, the ribbed leg is about 7\" long, and the foot measures about 9\" long but stretches a lot to fit extremely well. When worn there are no wrinkles or bunching and the toe seam is very smooth.Each of the three pairs has a different accent stripe color which looks nice but I wish they were all the same color to allow a cohesive look when they start to wear out and I need to mix the pairs.  The colored heel stripe will show when wearing a lower boot or shoe.Fiber content is 60% polyester, 31% cotton, 6% nylon, and 3% elastane.  With that fiber content they should wear very well.I tossed them in a regular wash load (warm temp, normal clean) and then into the dryer on a normal cycle and they came out fine.  My photo with one sock going one way and the other sock going the other way was taken after being washed.  The washing instructions recommend a more cautious washing: Machine wash cold, wash with like colors, use gentle cycle, only non-chlorine belach when needed. Tumble dry low.  Do not iron.  Do not dry clean.", "title": "Nicely Padded Sole Is Great For Everyday Wear", "location_and_date": "Reviewed in the United States on June 23, 2022", "verified": false, "rating": "4.0"},
{"asin": "B09K4YNFB1", "text": "I ordered these socks for everyday walking around socks. I appreciate extra cushion in my socks and these are ok for that purpose. Plus I like the blue color.  The sizing seems fine for me as I normally wear a 12 wide, and these are not too tight. Hold up on my calf’s fine. I am not sure anyone would want lesser cushioned socks and more is always better. Can not advise on how well they would hold up on a long hike though.", "title": "I always like more cushion.. So I gave these a try", "location_and_date": "Reviewed in the United States on July 16, 2022", "verified": false, "rating": "4.0"},
{"asin": "B0BRK4LTH2", "text": "These socks have extra cushioning on the soles of the feet.  Comfortable to wear.  Only complaint is that they are longer than I expected in the leg, and they came up above the calf, almost knee sock length, on a 6 ft tall guy with long legs.", "title": "Nice cushioned bottoms", "location_and_date": "Reviewed in the United States on June 27, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0BRK4LTH2", "text": "These Amazon Essentials socks are high quality although their efforts on packaging are minimalist at best. When I received the package, I thought they were a returned item based on the packaging. The socks are folded up and in a sealed plastic bag with a little card thrown in the package providing the basics of the socks. I took nothing away from the rating because you throw out the packaging anyway right after opening them up, but I was just caught off guard a bit because of the difference from other socks I have purchased.The socks are warm and comfortable with a good weight to them; they are thicker than you would find in a dress sock and compare more closely to the thickness of an athletic sock. I would agree with the listing calling these a crew sock as they come up the leg as I would expect from a crew sock. I selected the Regular size which fits me well, normally I wear a 11.5 shoe. I found the price of these to be very inexpensive for the quantity and quality of socks you receive. Note, these are referred to as \"Amazon Essentials Men's Cotton Cushioned Performance Work Crew Sock”, but cotton only makes up 39% of the socks, synthetic materials make up the other 61% of the socks.", "title": "Cotton content is only 39% of the material even though these are referred to as Cotton", "location_and_date": "Reviewed in the United States on June 20, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0BRK4LTH2", "text": "These are comfy socks that stay up. My husband thinks they're really comfortable and he's happy with them. I think he looks really cute in these long-style socks. Overall: good buy; worth the money.", "title": "Comfy", "location_and_date": "Reviewed in the United States on June 22, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0BRK4LTH2", "text": "Socks are soft and cushioned well. Doesnt have a arch support and they do leave fuzz even after being washed. The leg portion is on the tighter side so if you have bigger legs be aware. They do continue to stretch throughout the day so that's good.", "title": "I bit tight but comfortable", "location_and_date": "Reviewed in the United States on June 23, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0BRK4LTH2", "text": "I'm not a fan of very thick crew socks, and these are at the higher end for my personal preference. They are also larger and longer than I expected from socks that go from size 6.On the other hand, they seem well constructed and will probably be a good fit for someone who wears shoes or boots that aren't as tight as mine.", "title": "These socks are somewhat larger than I thought they'd be and much thicker than I hoped.", "location_and_date": "Reviewed in the United States on June 18, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0BRK99HQG", "text": "There's not much to say about these, they're socks. They fit as expected and are the correct height. Not really the best deal though for 4 pairs, honestly hanes and other brands are a better bargain for the price. They're okay quality pretty average in that area too.", "title": "Crew socks", "location_and_date": "Reviewed in the United States on June 18, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0BRK4LTH2", "text": "I have had good experiences with other Amazon house-branded items, so I expected these socks to be of good quality and comfort as well based on that. So far I have not been disappointed.I selected the 6-12 size and they fit correctly. I chose black over white because I have plenty of white socks; black is better for wearing with slacks or suits, and I needed more. They're comfortable and provide sufficient cushion to ease discomfort on the bottoms of my feet when I am standing.The price is particularly nice. These are quite affordable and are competitive with other brands.I looked these over and found no issues with uneven seams, no pulled threads and no holes out of the package. I really cannot expect anything more than that.So far I am pleased with these socks. They fit nicely, they're comfortable, and they're affordable.", "title": "Comfortable and Affordable", "location_and_date": "Reviewed in the United States on June 28, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0BRK4LTH2", "text": "My husband tried these Men's Cotton Crew Socks from Amazon Essentials, he love them.The size I chose is 6-12 and My husband's feet size is 11.5. As you can see from my photo, these socks fit him pretty well. There are total 4 pairs of socks in the pack and they look exact the same as the listed photos on Amazon.The socks are very well made. I really like the fabric of these socks, it feel pretty soft and stretchy. The thickness of these socks is decent, my husband says these socks are thicker than dress socks. He also complimented that the wearing experience is good, warm and comfortable.I have purchased other goods from Amazon Essentials before and I notice it always carries a decent made quality. These 4 pairs of socks are for sure another nice product from Amazon Essentials.Overall, I like these socks a lot and I would highly recommend!", "title": "Well Made, Soft & Stretchy, Decent Thickness, Good!", "location_and_date": "Reviewed in the United States on June 17, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0BRK4LTH2", "text": "I have been wearing these for a couple of weeks. They fit well, have good elasticity, and are equivalent to Hanes socks. They are a good value for the price.", "title": "Good socks!", "location_and_date": "Reviewed in the United States on July 8, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0BRK99HQG", "text": "Nice soft material that fit perfectly.No toe bunching and very comfortable.", "title": "Comfortable", "location_and_date": "Reviewed in the United States on July 11, 2023", "verified": false, "rating": "5.0"},
{"asin": "B09K4YFRWL", "text": "Well padded and soft!", "title": "Comfortable", "location_and_date": "Reviewed in the United States on July 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YFRWL", "text": "This sock is nice but was tight around the ankle", "title": "narrow around ankle", "location_and_date": "Reviewed in the United States on August 17, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09K4YFRWL", "text": "I like the way they fit and feel.", "title": "Feel good", "location_and_date": "Reviewed in the United States on July 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YFRWL", "text": "I purchased these socks for hiking.  They fit perfectly and feel great!", "title": "Exactly as discribed", "location_and_date": "Reviewed in the United States on June 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YFRWL", "text": "Nice cooler weather socks, Not warm enough for really cold by themselves.  They are soft, fit well, don't slide down or bunch up.  I wear a size 8 shoe.", "title": "works as expected", "location_and_date": "Reviewed in the United States on January 10, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K4YFRWL", "text": "comfy and well made for price", "title": "comfy", "location_and_date": "Reviewed in the United States on January 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YFRWL", "text": "Nice socks. fit well. Good for shoes and boots. Best for cooler weather.", "title": "Nice socks", "location_and_date": "Reviewed in the United States on July 31, 2022", "verified": true, "rating": "5.0"},
{"asin": "B09K4YFRWL", "text": "Cheap.  Ripped holes easily", "title": "Ripped easily", "location_and_date": "Reviewed in the United States on April 5, 2023", "verified": true, "rating": "2.0"},
{"asin": "B09K4YFRWL", "text": "The socks fit and were comfortable although not very cushioned. However after only one day of wear they showed so much fuzz and wear in the back above the heel (unusual for sure) I decided they were not worth the money and returned the entire pack of three.", "title": "Not worth it", "location_and_date": "Reviewed in the United States on February 16, 2023", "verified": true, "rating": "1.0"},
{"asin": "B09K4YFRWL", "text": ".... about these is the option for the larger size, instead of the usual \"size 6-9\" sizing that we most often see.Misses Shops too much is a fitness trainer at a spa.One of her many fitness duties is leading hikes.Sometimes on flat grounds and sometimes up and down mountains.Her first experience with these was leading a flat hike.While cold months can command a really thick hiking sock; most of our months are warm to hot.These are not a thick winter type sock.They are not *too* thin, but they are a more correct weight and thickness for medium to mild climates; at least that's her impression so far.In the flat hike, she found these to be just right in fit and feel; no slipping around in her shoes; comfortable.Her next adventure was a 5 mile mountain hike.These also worked well going up and down inclines/declines with no slippage inside her shoe.The one thing she did mention is on that 5 mile mountain hike they are just a bit hotter on a hot day than a wool or mostly wool hiking sock.These appear to be of quality materials and workmanship.Misses Shops Too Much is glad I ordered them.I hope this review has enabled you to make an informed purchase decision.I rarely give an overall 5 star rating.", "title": "The nice thing...", "location_and_date": "Reviewed in the United States on June 30, 2022", "verified": false, "rating": "4.0"},
{"asin": "B0BRK7SLXP", "text": "These socks are exceptionally comfortable. The cotton material feels soft and gentle against my skin, providing a cozy and cushioned feel throughout the day.  I have worn them during long work hours and physical activities, and they have kept my feet relatively dry and cool, minimizing the discomfort of sweat and odor. Despite frequent wear and washing, they have retained their shape and color quite well. Overall, I would recommend them.", "title": "Comfortable and Durable Work Socks", "location_and_date": "Reviewed in the United States on August 3, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0BRK7SLXP", "text": "Amazon Essentials cotton crew socks are surprisingly the perfect fit. They're not too loose or too tight; they fit my size 9 feet perfectly and look attractive. The soles are cushy, and I think the arch support they provide too. I can't tell if they're for work boots, but they seem a little thin for hiking boots which is what I was hoping for. Hopefully, they'll become a good trail running sock, but I haven't had the opportunity to test that yet. They're not sweat wicking, so fingers crossed there are no blisters. I'll update if that happens.", "title": "Soft sock; not sure if they're great for sports though", "location_and_date": "Reviewed in the United States on July 10, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0BRK7SLXP", "text": "My daughter wears shoes in size 9.5 and size 10 in those that don’t come in half sizes. I ordered these socks for her in the 6-9 size. I was a little concerned that they will be too small for her but they actually fit her perfectly. She says that they are comfortable and despite being on a thicker side they feel breathable and they don’t get her feet feeling too warm.My daughter wore two of the pairs straight from the package, without washing them first and there was significant amount of shedded fluff that came out from the socks on the carpet. She washed the other two pairs first and the shedding was minimal. After a couple of washing and drying cycles the shedding stopped completely on all of the pairs.", "title": "Good fit", "location_and_date": "Reviewed in the United States on July 12, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0BRK7SLXP", "text": "These socks feel super soft. The sole is nicely cushioned whereas the top has this thinner mesh making them a bit more breathable. The seam at the toes are noticeable but they don't chafe. That being said they are noticeable so I know that can be an issue for some who have more sensitive feet. The \"arch\" support is almost non-existent; I can feel only the slightest snugness around the arch area. Having some other socks that have arch support bands, I can attest there is a difference with some of my other socks that actually provide this arch support. The fit around the calf is a bit snug so it does leave marks on my leg at the end of the day. Overall a nice soft pair of socks for everyday where but not necessarily my favorite.", "title": "Nice cushioned socks", "location_and_date": "Reviewed in the United States on June 24, 2023", "verified": false, "rating": "4.0"},
{"asin": "B07GRGKH71", "text": "I tried wearing these right out of the package and they were a little large, but nothing I couldn't work with. Then, I washed them and tried them on again, and they fit perfectly. I've been wearing them ever since for a couple months now with no issues.", "title": "Wash them before deciding if it fits!", "location_and_date": "Reviewed in the United States on August 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0BRK48RV1", "text": "Review for: Amazon Essentials Women's Cotton Cushioned Performance Work Crew Sock, 4 PairsI found these socks to be well made and to fit perfectly. They do have quite a bit of cushioning and so work with well boots. They are pure white and wash well.", "title": "Cushy and comfy", "location_and_date": "Reviewed in the United States on June 18, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0BRK7SLXP", "text": "This pack contained 4 pairs of crew socks. They are made from a soft material and really comfy. Perfect for under tennis shoes. Sizing is correct. They have nice stretch without being too loose. I'm always on the search for the perfect sock and these are pretty darn close to being just that.", "title": "Crew Sock - 4 Pairs", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0BRK7SLXP", "text": "The first thing I noticed was how nice and thick these are. A little thicker than your normal crew sock. They are very soft on your feet too :)  They are also pretty warm...especially when it's really hot outside. My feet got pretty warm when I was at work and it was Really hot outside. However, I Am in the heat most of the day...so I don't think they would be so warm in a cooler environment. I would say these are more between a crew and a knee-high sock. At least on me they are...lol  They're very comfortable socks and I was pretty surprised at the great quality. I don't think these will wear out as fast as most of my socks do... because of them being a little thicker and better material. They definitely stay in place all day too. No sliding down on your leg. Wonderful Socks!!!", "title": "Very soft and comfortable", "location_and_date": "Reviewed in the United States on July 1, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0BRK7SLXP", "text": "These socks are great, I personally only wear these in winter or with boots. You can tell they are quality-made, and on top of that, they are extremely comfortable. They are thick and cushioned but they still manage to be breathable. I definitely recommend trying these out if you are in the market for crew socks!", "title": "Performance socks", "location_and_date": "Reviewed in the United States on July 9, 2023", "verified": false, "rating": "5.0"},
{"asin": "B07GRGKH71", "text": "A little too tight all around if you have wide feet or swollen ankles, but wearable and well made.", "title": "a little tight", "location_and_date": "Reviewed in the United States on August 21, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07GRGKH71", "text": "Bought these on recommendation from Amazon influencer page.  They fit great and are very soft.  The quality is good.  They run a little big but not too far off of what was expected.", "title": "Good quality and great fit", "location_and_date": "Reviewed in the United States on August 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GRGKH71", "text": "I am always looking for socks, and these are comfortable, and soft. I found them a bit large but still a great value.", "title": "Good product", "location_and_date": "Reviewed in the United States on August 5, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0BRK48RV1", "text": "These are nice basic midweight socks. They are quite comfortable and stay up without being tight.  I have worn these on a hot summer day with my work shoes that run a little loose. I was pleasantly surprised to find that they were very breathable so they weren't too hot.  I would rate these a year round sock.  They are an excellent value.", "title": "Nice comfy midweight cotton socks", "location_and_date": "Reviewed in the United States on July 5, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0BRK48RV1", "text": "The material was nice and thick. They were the perfect length to half my leg. And got like 4 pairs in this. These are awesome!!", "title": "Loved these", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": false, "rating": "5.0"},
{"asin": "B07GRGKH71", "text": "Definitely well made and durable. Cure on my feet.", "title": "Nice socks", "location_and_date": "Reviewed in the United States on August 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GRGKH71", "text": "These are exactly what I needed for work pants. Fit great. Stay in place and not too tight.", "title": "Comfortable fit", "location_and_date": "Reviewed in the United States on August 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GRGKH71", "text": "Very soft and fit great", "title": "Great socks", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GRGKH71", "text": "nice comfy socks", "title": "very comfortable", "location_and_date": "Reviewed in the United States on August 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GRGKH71", "text": "Good Quality", "title": "Quality", "location_and_date": "Reviewed in the United States on August 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GRGKH71", "text": "Needed a longer sock to use with foot orthotics", "title": "A good quality of product", "location_and_date": "Reviewed in the United States on August 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GSL6PZ9", "text": "I got these to wear to work during summer, hoping they wouldn't make my feet too warm and they're really great for that.", "title": "Perfect for summer", "location_and_date": "Reviewed in the United States on August 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GSL6PZ9", "text": "They fit well and were comfortable.", "title": "comfortable and soft", "location_and_date": "Reviewed in the United States on August 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GSL6PZ9", "text": "Looking for a thin weight lo-cut sock. These fit the bill perfectly. Good quality for a fair price. Very comfortable.", "title": "Good quality", "location_and_date": "Reviewed in the United States on August 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GSL6PZ9", "text": "I'm about to order a second package of these and maybe more. They are mostly cotton, which can be difficult to find in low-cut socks. They fit my size 9.5 feet comfortably and stay up. They are a bit thin, but I like that because it means my shoes will still fit comfortably even after wearing flip-flops for a long time. I bought the white ones, so I can't say how the colors hold up, but the white washes well and did not shrink.", "title": "Breathable cotton that stays up", "location_and_date": "Reviewed in the United States on July 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GSL6PZ9", "text": "These are good socks, fairly thinThese are good socks, fairly thin (which I was hoping for), soft, mostly cotton, reasonably stretchy, not binding. Unsure how well they'll wear or last, but starting out well.", "title": "Good socks", "location_and_date": "Reviewed in the United States on August 1, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GSL6PZ9", "text": "Amazon basics are always high quality and these are no exception!", "title": "Comfortable, great fit,  good value", "location_and_date": "Reviewed in the United States on August 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GSL6PZ9", "text": "I wear size 6 and these are a little higher than expected for low cut.", "title": "Not very low-cut", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07GSL6PZ9", "text": "Finally found socks that don’t fall down and are the perfect weight. Not tight around the ankle either.", "title": "Best socks", "location_and_date": "Reviewed in the United States on July 30, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GSL6PZ9", "text": "I was looking for a comfortable pair of black socks and these worked out great! Great socks for all year round. They are low-cut ankle socks, not no-show socks. I had some black socks I really liked from DSW, but I can't find them anywhere. I believe these new socks are better and higher quality!", "title": "Great pair of black socks!!!", "location_and_date": "Reviewed in the United States on July 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07GSL6PZ9", "text": "I like different colors to match my outfits", "title": "Very comfortable", "location_and_date": "Reviewed in the United States on July 31, 2023", "verified": true, "rating": "5.0"},
{"asin": "B08PF59YT7", "text": "I'm having trouble finding socks that don't leave marks. I'm not overweight, and a doctor said I don't have edema (or didn't when she looked), but every new pair of socks I buy leaves sock marks. I bought these in a size up hoping for the best, but I still got marks. Didn't feel as tight as some, so maybe they'll work for you and other people who don't have my weird issue.", "title": "These seem like nice socks but they still give me sock marks", "location_and_date": "Reviewed in the United States on July 30, 2023", "verified": true, "rating": "5.0"},
{"asin": "B08PF59YT7", "text": "If you have a larger shoe size and are tired of settling for one size fits all that are too tight because extended size socks have disappeared from stores, then these are the socks to buy! I am a size 9 shoe and these extended size socks (8-12 shoe size) fit perfectly. My toes now have their proper space, not all jammed up and squished together.", "title": "True Extended Size", "location_and_date": "Reviewed in the United States on July 28, 2023", "verified": true, "rating": "5.0"},
{"asin": "B08PF59YT7", "text": "Soft. Enough stretch for a good fit, but not too much to take away the benefit of the mostly cotton fibers.Machine wash and dry well. Maintain good fit.", "title": "Great socks for the price!", "location_and_date": "Reviewed in the United States on August 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B08PF59YT7", "text": "Love the socks.  just what I wanted. So happy to find them.", "title": "Lightweight cotton socks", "location_and_date": "Reviewed in the United States on August 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B08PF59YT7", "text": "These are so soft and stretchy they don’t dig into my skin at all. Highly recommend", "title": "Amazing for people with bigger calves/ankles", "location_and_date": "Reviewed in the United States on August 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B08PDZ8TP6", "text": "I  love these socks.  They are so soft and comfortable.  I will be purchasing them again.", "title": "Socks are all that I could want in a sock.", "location_and_date": "Reviewed in the United States on August 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B08PDZ8TP6", "text": "Sock fits well and is not tight around you ankle", "title": "True to size not binding", "location_and_date": "Reviewed in the United States on August 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B08PF5LYDW", "text": "I would like to buy a package of just white ones?  Is that possible?", "title": "They're great", "location_and_date": "Reviewed in the United States on August 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B08PF59YT7", "text": "Fit perfectly and comfortable in the summer.", "title": "Perfect socks for summer", "location_and_date": "Reviewed in the United States on August 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "B08PF59YT7", "text": "I used to buy crew sock at Walmart, but they don't carry them anymore, but that is okay, because the quality was barely fair while these Amazon Essentials Crew Socks are the best quality crew sock I have ever found as well as being a great value for the price.  The fabric/yarn is soft and stretches as it should, the size is perfect and the colors are great.  I will be ordering these Amazon Essentials Crew Socks again and will keep a good supply of them on hand to wear every day.", "title": "BEST CREW SOCK I EVER BOUGHT", "location_and_date": "Reviewed in the United States on June 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SF4FGK", "text": "The material is very comfortable but the elastic is way too tight", "title": "Elastic cut off", "location_and_date": "Reviewed in the United States on July 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SF4FGK", "text": "The back and blue socks are almost the same color but when you put them together and now I think instead of the two different colors blacks and blues are all different colors so instead of having just the two colors there are four different colors there must have been different dye lots.  It is the same with the gray and green there are 4 different colors.  I am going to keep them because I don't think you would notice that they are different colors unless you were looking for it. I would only be using them under slacks or jeans anyway.  I really do like them they are soft and feel nice on my legs.", "title": "Coloring is so close it is barely noticeable but....", "location_and_date": "Reviewed in the United States on March 10, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0B5SF4FGK", "text": "I got these thinking they would be good for plus size/wide cafe and they aren't. They don't fit all the way up and when I got them all the way up, they kind of cut off circulation. Would be good for someone with non wide cafe.", "title": "These are nice but not for plus size.", "location_and_date": "Reviewed in the United States on April 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0B5SF4FGK", "text": "Comfortable to wear all day in style, I would recommend to a friend", "title": "Good quality", "location_and_date": "Reviewed in the United States on May 25, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SF4FGK", "text": "I'm very satisfied with these knee socks. I have washed them three times now and they look just as good as the day I received them. I would not recommend them to those that have a calf much bigger than 14\" as they do fit snug.", "title": "I would rate these socks equivalent to Gold Toes.", "location_and_date": "Reviewed in the United States on March 28, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SF4FGK", "text": "These socks are exactly as I expected. Warm, soft and cozy. I just wish the packaging wasn’t so tight. The plastic piece holding the socks together was so close to socks that when I cut it off I accidentally cut one of the socks. Other than that they are perfect.", "title": "Cozy Socks", "location_and_date": "Reviewed in the United States on February 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SF4FGK", "text": "Nice socks!", "title": "Knee high socks", "location_and_date": "Reviewed in the United States on February 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SF4FGK", "text": "Very tight and uncomfortable at the knee, even though I have thin legs. Had to cut the top band where it was cutting off the circulation. With all the socks available, poor choice on my part.", "title": "Way too tight at the knee", "location_and_date": "Reviewed in the United States on March 5, 2023", "verified": true, "rating": "1.0"},
{"asin": "B0B5SF4FGK", "text": "Hello everyone,When it comes to my feet, I chose comfort over looks, however with this set, I don’t have to compromise. They look nice, well made with 75% cotton and one can definitely feel it as they are very soft. Wearing them for almost 2 weeks now, I have found that #1they do a great job at keeping my legs warm especially when I wear skirts or nightgowns and #2they washed well. That said, these are on the thin side. When I wore them during chilly days, they were a bit slippery inside the shoes. My legs felt warmer, but my feet and toes were cold. Also, the stretchy band at the top felt tight, almost like compression socks. It doesn’t bother me as much, but it’s worth mentioning! In a nutshell, I like the warmth and comfort these provide as they cover my entire legs as opposed to crew socks, but perhaps the thickness would be more suitable for warmer weather.Thank you!", "title": "Love the softness. May be more suitable for warmer weather", "location_and_date": "Reviewed in the United States on March 13, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0B5SF4FGK", "text": "I like these socks. They are soft and true to size. They earned extra points with me because they go up as high as I like them. The only thing is, there isn't much stretch at the end top of the socks but they are still functional.", "title": "Impressed", "location_and_date": "Reviewed in the United States on March 26, 2023", "verified": false, "rating": "4.0"},
{"asin": "B07JM4NS9H", "text": "These socks have a terrible size chart so hopefully this will help someone in deciding what to purchase because they really are great, cute socks! I had purchased the 2T-3T my daughter wore for a couple years and I wanted to get the next 'size up'... after reading other reviews I went with a MEDIUM....A MEDIUM SIZE SOCK IS PROBABLY FOR SIZES 12C TO 2Y. I should have ordered Small or maybe 4t-5t? Small sock would fit probably 9C-13C. Hopefully this helps someone because they are great quality and priced socks!", "title": "SIZING CHART IS HORRIBLE", "location_and_date": "Reviewed in the United States on August 10, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JM4NS9H", "text": "These hold up well, and I love having this many matching socks. So many toddler socks come in variety packs that are hard to keep matched. These help my sanity.", "title": "Nice Quality and Easy", "location_and_date": "Reviewed in the United States on August 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NS9H", "text": "Fit perfect nice and soft.", "title": "Soft and thick", "location_and_date": "Reviewed in the United States on August 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JM4NS9H", "text": "Muy buena calidad", "title": "100% recomendado", "location_and_date": "Reviewed in the United States on August 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SDB726", "text": "I like that they have more cotton. Socks fit perfect especially around the ankle (unlike the No Nonsense that I bought recently which were a bit snug at he ankles).", "title": "Perfect thickness for spring and summer", "location_and_date": "Reviewed in the United States on July 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SDB726", "text": "I like the pretty edge and the fit is so good.", "title": "They stay up when worn.", "location_and_date": "Reviewed in the United States on May 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NS9H", "text": "Great quality and perfect fit! 10/10", "title": "⭐️⭐️⭐️⭐️⭐️", "location_and_date": "Reviewed in the United States on August 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NS9H", "text": "Great for my 2 year old, they are not thin which I like. Comfy", "title": "Awesome", "location_and_date": "Reviewed in the United States on August 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NS9H", "text": "Love the amount of pairs. Great to have all matching", "title": "Great socks", "location_and_date": "Reviewed in the United States on August 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NS9H", "text": "So these came today and while I bought them for my 9 year old that wears a size 7 big kid shoe, the medium black sock I bought only fit my 4 year old that wears a size 10 or 11 toddler shoe. I'm really disappointed but other than that I like that the sock is thick and look like they might last a while. Sizing miscommunication is the only reason I did not give 5 stars.", "title": "Didn't like not knowing sizes for the small, medium, and large", "location_and_date": "Reviewed in the United States on May 30, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0B5SDB726", "text": "Pretty good, a little tight.  Maybe bigger size?", "title": "Will stay up", "location_and_date": "Reviewed in the United States on April 16, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0B5SDB726", "text": "Very comfortable knee sock. Just what I was looking for!", "title": "Comfortable fitting sock", "location_and_date": "Reviewed in the United States on April 15, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0B5SDB726", "text": "When I wear dress pants, I like longer socks and these are perfect: reasonably priced, cotton/poly blend, wash well, look nice and stay up. Very pleased with this purchase.", "title": "Great trouser socks! Good texture, weight, and stay up!", "location_and_date": "Reviewed in the United States on February 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SDB726", "text": "Much thinner than expected; more like tights than socks.", "title": "Thin", "location_and_date": "Reviewed in the United States on May 24, 2023", "verified": true, "rating": "2.0"},
{"asin": "B07JM4NS9H", "text": "These are pretty durable socks. My 4 year old wears them daily and has not gotten a whole in them yet. They hold their shape and don’t shed strings or elastic.", "title": "Durable", "location_and_date": "Reviewed in the United States on June 18, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JM4NS9H", "text": "My 4 years old love it. He refuses to Wear any other socks. His shoe size is 11 little kid.", "title": "Just perfect", "location_and_date": "Reviewed in the United States on July 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SDB726", "text": "I was expecting something a bit thicker than these are. I would describe these more like trouser socks, even if they're cotton and not nylon. They are thin and comfortable, but there's no padding of any kind under or around the foot. They are *knee-high*, but I'm 5'3\" and they are a bit too high covering the lower half of my knee. They'd be comfortable as a summer weight sock to wear with office attire. Warm enough to keep you comfortable in an air-conditioned office, but definitely not heavy enough for winter use. The scalloped edging at the top is really cute and makes these look more feminine, but when you put them on it all but disappears, so I'm not sure what the point of that was. These are nice knee-highs if you need something breathable and lightweight. I'm not convinced the elastic will stand up because they feel like they'd be easily stretched out, but only time will tell. Overall, not the best, not the worst, depending on what you're looking for. At the current price of around $4.50/pair, they're a decent value for money. One last note on these - if you have pets, EVERYTHING sticks to these - pet hair, lint, dust, etc. The standard wool blend socks I wear every day don't attract anywhere near as much stuff as these do, so that represented a major downside for me.", "title": "More Like a Trouser Sock.", "location_and_date": "Reviewed in the United States on March 11, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0B5SDB726", "text": "These are nice socks. They stay up, wash and dry well, and they keep my feet warm around the house. The ruffle detail is cute and adds a little something to an otherwise plain pair of socks.", "title": "Nice socks", "location_and_date": "Reviewed in the United States on April 24, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0B5SDB726", "text": "This is a review of “Amazon Essentials Women's Casual Cotton Rib Scallop Top Knee High Socks, 4 Pairs, Black, 6-9[As a vine reviewer, I am pledging not to be compensated or influenced by the vendor;  I state my opinions based on my personal experience without any bias or pressure]This is a set of four pairs of women’s cotton knee high socks (8 socks on total). It’s predominantly made out of cotton in Pakistan and has sufficient nylon content to keep the socks fairly stretchable. The size that we ordered was for women’s sizes 6 to 9 , and our daughter (size 8 )was able to wear it very comfortably. The socks sem to have reasonably good strength in the elastic, and we were able to wash it without any perceptible loss of color. I do urge you to wash it in a light setting to prevent the fabrics from being stretched and getting a bit torn in the process. All in all the price seems to be in a reasonable range and the quality is quite acceptable. The one thing that our daughter also did like was at the top of the socks there is a nice design (a bit like a ruffled type). On balance, a commodity product like this is very difficult to distinguish from other competitors, but given that this is an Amazon essentials brand, the quality being quite acceptable, we give it four stars.", "title": "An Amazon Essentials pack of women’s knee high socks - high on quality and usability", "location_and_date": "Reviewed in the United States on March 3, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0B5SDB726", "text": "In general I like these socks and will wear them. I wish they had a bit more spandex or nylon in them, because they are very difficult to pull on over my calves. Once they're on and pulled up all the way they have a very snug fit, but so far do not make my leg feel strangled, as I thought they might. The top band that fits just below the knee is not so tight that it cuts off the circulation, so the overall feeling of being tight/snug does not increase over time as u wear them. The foot part fits okay with the heal in generally the right spot for my size 8 foot. The socks seem to be well made and of good quality, though i'm not yet sure how they will hold up in the wash. time will tell...", "title": "Nice socks, tight fit.", "location_and_date": "Reviewed in the United States on March 5, 2023", "verified": false, "rating": "4.0"},
{"asin": "B09K4ZHW1X", "text": "Was looking for an ankle sock for the summer months. Hoping they'll last a while and intended to order a size up. Reading the sizing guide, I wanted 4T-5T. 4T-5T wasn't an option but 3-4T was....so I went with that. Socks arrived and packaging said \"4T-5T\"....so that's good news for me but probably disappointing for someone else. Unfortunately they're sized much smaller. Visually, they are similar to a Hanes 2T-3T sock in size (see picture). That said they have a lot of more stretch possible than a Hanes sock does so they will probably last a bit longer than the Hanes will. They fit my son perfectly right now. He is in toddler size 9 shoes. 6.25\" from heel to big toe. Medium thickness socks....thicker than Hanes. Good for the California winters that we have but probably something thicker would be better for actual winters. They're soft. And seem breathable. Overall they seem good....just annoyed with the sizing since I was trying to intentionally buy the next size up not get more of his current size.", "title": "Good socks, run small", "location_and_date": "Reviewed in the United States on May 24, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K4Z25FD", "text": "size was a little larger than expected but the the socks are soft and good quality - The kiddos love them", "title": "Good Value", "location_and_date": "Reviewed in the United States on August 14, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K4ZHW1X", "text": "Bought these black socks in medium for my child who wears like a 10t shoe. I was ok with them being big, so they didn’t outgrow them quickly. Unfortunately they were WAY too big. They actually fit my adult foot. Quality of the socks seems great though. So I reordered in small. Fingers crossed the small is small enough.Btw, I highly recommend only buying sets like this where every pair is the same. Makes post laundry matching so much easier!(Deducted 1 star for the sizing, but I’m sure they’re 5 stars if they fit you)", "title": "Good socks but the black ones run large!", "location_and_date": "Reviewed in the United States on June 28, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K4ZHW1X", "text": "I purchased these for my 7 year old and they came big enough for myself. There’s no way he could have worn these. But in all they are some decent socks for the price i paid", "title": "Big", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K4Z25FD", "text": "For children's multipack, these are a good value.", "title": "Good Value", "location_and_date": "Reviewed in the United States on August 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4Z25FD", "text": "My kids love it, not too thick not too thin", "title": "Value for money", "location_and_date": "Reviewed in the United States on July 26, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4Z25FD", "text": "Great for replenishing the never ending missing toddler socks. Thick fabric great for comfort but keep in mind when sizing shoes.", "title": "Thick and comfy", "location_and_date": "Reviewed in the United States on July 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4Z25FD", "text": "I’m a sock person. I put socks on my grandson to play  around my outside tile covered patio. I don’t like his little feet getting sweaty and he may slip. Good socks!!", "title": "Nice socks", "location_and_date": "Reviewed in the United States on May 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K4ZHW1X", "text": "They are a lot smaller than others brands in the same size I would definitely go up a size from what you normally buy. Other than that they are fine. Very soft but don't feel like they will hold up as well as I would like.", "title": "Soft but run small", "location_and_date": "Reviewed in the United States on August 4, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09K4ZHW1X", "text": "It's great that there are so many pairs of socks in this pack. I'm not sure how long they will last after repeated washings, but you get what you pay for I guess.", "title": "Lots of socks, but quality is questionable", "location_and_date": "Reviewed in the United States on April 12, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JKP6BFC", "text": "Being the custodial. Great grandparent of three littles, I find socks to create one of the problems or situations in my life. My socks keep getting divorced in the dryer. So I look for replacements about anywhere I can. These socks do really very well and when or if they do divorce they can usually mate up with another lonely sock. In that way everybody is happy again. I do like these socks very much. My littles like them as well. Life is good.", "title": "You can never have enough socks", "location_and_date": "Reviewed in the United States on August 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JKP6BFC", "text": "We love these socks! It’s the second time we have ordered!Long tube, and good foot size!!", "title": "Great fit!!", "location_and_date": "Reviewed in the United States on August 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JKP6BFC", "text": "I ordered these for my almost 4 year old and 5 year old. They fit as expected. These work perfectly for their high top tennis shoes.", "title": "Fit as expected", "location_and_date": "Reviewed in the United States on August 17, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JKP6BFC", "text": "They a thick but not too thick!.. I got them for my daughter being she can only wear black socks to school. The material is great", "title": "The best", "location_and_date": "Reviewed in the United States on August 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JKP6BFC", "text": "No se dañan con facilidad , son de muy buena calidad", "title": "Buena tela", "location_and_date": "Reviewed in the United States on August 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JKP6BFC", "text": "Good quality", "title": "Quality", "location_and_date": "Reviewed in the United States on August 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JKP6BFC", "text": "I have ordered these socks already several times for my boys  because they have high percentage of cotton. They are soft and don’t feel like other polyester socks in which you sweat all day long.They are great but have only one con…they break on heal very quickly.", "title": "Great socks but break", "location_and_date": "Reviewed in the United States on July 17, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JKP6BFC", "text": "These socks are much better quality than I had expected! Highly recommend", "title": "Fantastic socks!", "location_and_date": "Reviewed in the United States on August 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JKP6BFC", "text": "Love these socks, they fit perfectly, are thick cotton quality, home up and wash well.", "title": "Terrific boys socks", "location_and_date": "Reviewed in the United States on August 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JKP6BFC", "text": "ok", "title": "ok", "location_and_date": "Reviewed in the United States on August 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NY1V", "text": "Great socks. Size was really small.", "title": "Runs small", "location_and_date": "Reviewed in the United States on August 14, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JM4NY1V", "text": "Little to thick for my son when wearing shoes, but great for around the house for the cold winter months.", "title": "Thick socks", "location_and_date": "Reviewed in the United States on May 16, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JM4NY1V", "text": "Perfect size for my 16 month old and great quality!", "title": "Perfect! Excellent quality!", "location_and_date": "Reviewed in the United States on April 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NY1V", "text": "Soft good quality socks. Amazon essentials is always good quality.", "title": "Good quality", "location_and_date": "Reviewed in the United States on March 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NY1V", "text": "Bought these for my toddler, soft fabric, thickness is thick enough to be warm but not thick enough to make his shoes too tight.", "title": "Good quality", "location_and_date": "Reviewed in the United States on January 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NY1V", "text": "Love that they are soft and thick for little feet", "title": "Perfect socks for 2 year old in winter", "location_and_date": "Reviewed in the United States on January 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NY1V", "text": "I dont know why it's so difficult to find socks that fit toddlers online but it is. The ones I saw had mixed reviews about sizing so I'd take a chance and they would be WAY too big. These are really nice socks. They fit great and are the perfect size for my 2 year old. I ordered 3T and they are a true 3T. They fit him with a bit of room to grow, but not so much that they will slide around on his foot. The material is very nice, very comparable to Hanes or Fruit of the Loom. I will definitely buy these socks again.", "title": "Perfect Fitting Toddler Socks", "location_and_date": "Reviewed in the United States on December 30, 2021", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NY1V", "text": "There not to thick , soft and comfortable", "title": "My grandbaby love these socks", "location_and_date": "Reviewed in the United States on January 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NY1V", "text": "Good socks will be used for my 1 year olds boots so he's not irritating his legs. Pretty thick", "title": "Fine socks", "location_and_date": "Reviewed in the United States on November 11, 2022", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NY1V", "text": "Runs small", "title": "Runs small", "location_and_date": "Reviewed in the United States on January 24, 2023", "verified": true, "rating": "3.0"},
{"asin": "B07JLY3QC6", "text": "I liked them very much brought them for my grandbaby for the winter season", "title": "Socks", "location_and_date": "Reviewed in the United States on August 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JLY3QC6", "text": "Aun no la he usado,  pero se ven de buena calidad", "title": "Se ven de calidad", "location_and_date": "Reviewed in the United States on July 25, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JLY3QC6", "text": "These are very nice for my little cousin , he is 4 years. I love them.", "title": "Very nice indeed", "location_and_date": "Reviewed in the United States on July 20, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JLY3QC6", "text": "I love the classic sock style but more importantly the material and cost as well as perfect for my boys as they  all find the socks comfortable and long lasting.", "title": "100% Cotton! Durable & Comfortable", "location_and_date": "Reviewed in the United States on July 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JLY3QC6", "text": "My son loves these socks especially for around the house. Soft and comfy!", "title": "Perfect size and comfy!", "location_and_date": "Reviewed in the United States on July 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JLY3QC6", "text": "Tal cual la foto buena calidad", "title": "Muy buena calidad", "location_and_date": "Reviewed in the United States on July 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JLY3QC6", "text": "Got these for my 3yr old who's in a 9 shoe and noticed that they do run a little small. He can still wear them, just wish I would have sized up so I didn't have to pull them tightly for the heel to hit the right spot. Am going to try a size up and see how they work for him. I do like that they are softer and durable. He's always wearing his socks outside, no holes so far!", "title": "Cutest little boy socks, runs slightly small", "location_and_date": "Reviewed in the United States on April 16, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JLY3QC6", "text": "Soft, stays soft wash after wash", "title": "They fit!", "location_and_date": "Reviewed in the United States on July 1, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JLY3QC6", "text": "Bought these for my 7 year old who has larger feet. There’s room for his feet to grow. They are comfortable he says", "title": "Perfect socks", "location_and_date": "Reviewed in the United States on June 16, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JLY3QC6", "text": "fit small. wanted them for my 3 & 4 yr old since they're always mixing & losing socks but looks like only my 3yr old will wear them.... for a short time haha. would recommend sizing up.", "title": "maybe size up?", "location_and_date": "Reviewed in the United States on May 31, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SCNQQ3", "text": "You can never have enough kids socks, and these are good for kids who wear boots, or like longer socks. Decently made, and fit well. Would recommend.", "title": "Well enough made socks, good basics", "location_and_date": "Reviewed in the United States on April 9, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0B5SCNQQ3", "text": "I have noticed a small amount of pilling after washing these a few times, but, that seems to be the norm with almost any kids sock I've bought recently. They are stretching and fit my daughter's growing foot. They're in a lot of sports and constantly need some good socks and I like that these come in a large pack with lots of matches. I can't even imagine how to tell you how many single cute socks we have. Have decided to do packs now as it makes the chance of finding a match much easier. They're definitely decent quality and I wouldn't hesitate to order again.", "title": "Definitely great little crew socks", "location_and_date": "Reviewed in the United States on April 14, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0B5SCNQQ3", "text": "My two active boys go through socks incredibly fast. These socks fit them well and have lasted longer than I expected considering how often other socks get holes.  These are nicely made and good quality.", "title": "Nice socks", "location_and_date": "Reviewed in the United States on May 12, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0B5SCNQQ3", "text": "My daughter is a size 2 and I got the medium size and they fot perfectly. They are on the thinner side for socks but very nice. These will go perfectly with my daughter's school uniform. Definitely recommend!", "title": "Knee socks", "location_and_date": "Reviewed in the United States on April 9, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0B5SCNQQ3", "text": "Good value pack of soft cotton socks. I'm sure they'll hold up just like any other pair of cotton socks.", "title": "Good value white socks", "location_and_date": "Reviewed in the United States on April 5, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0B5SCNQQ3", "text": "The socks are a great quality. They fit as they should. The material is soft. They do say girls on the cardboard wrap rather than unisex, as the ad states, so you may want to keep that in mind.", "title": "Good quality socks.", "location_and_date": "Reviewed in the United States on April 3, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0B5SCNQQ3", "text": "The description said uni-sex, but the package we received were labeled as girls socks. The socks are comfortable and come up to just above the knee on my child. They are fairly thin and lightweight, which my kid prefers. They fit well and were comfortable to wear.", "title": "Thin, Cotton Knee Socks", "location_and_date": "Reviewed in the United States on April 7, 2023", "verified": false, "rating": "5.0"},
{"asin": "B07JM4NYYX", "text": "At first impression, the sock look like great quality, very soft and a thicker material which I love. My daughters wore them and said they were comfortable (my oldest has sensory issues). They have not gone through a wash yet, but I will update as soon as they do and see the result.", "title": "First impression review", "location_and_date": "Reviewed in the United States on August 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NYYX", "text": "These socks were purchased for my Great Granddaughter back to school package. They are very soft and none of that slip off the heel ending up down in the shoe. A great buy for the price.", "title": "Socks that really work", "location_and_date": "Reviewed in the United States on August 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NYYX", "text": "You never have enough socks. I truly believe that. We got these socks for our four year old girl. Socks tend to be her enemy and she avoids them as much as possible. These socks apparently are acceptable to her. She actually keeps them on. That’s saying a lot. She doesn’t complain about them either. Now that’s a really big biggie in her world. The socks look nice and don’t shrink in the wash. I think we’ve found a keeper in these socks.", "title": "Never enough socks!", "location_and_date": "Reviewed in the United States on July 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NYYX", "text": "My kid hates thick socks and I hate put flimsy socks on her. These are the perfect medium.", "title": "These are perfect!", "location_and_date": "Reviewed in the United States on August 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NYYX", "text": "I'm not a big fan of ankle or no-show socks so I get my daughters these. Great value for so many pairs. Soft comfy material feels good in the skin", "title": "Great socks", "location_and_date": "Reviewed in the United States on August 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NYYX", "text": "My finicky daughter loves these!", "title": "Amazing socks for sensitive lil feet", "location_and_date": "Reviewed in the United States on August 15, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JXGHH5G", "text": "Picky dresser.  These got the \"THESE ARE SO COMFY!\" approval.  Size kids 1.5 and the smalls were perfect.", "title": "Super comfy for picky dresser", "location_and_date": "Reviewed in the United States on August 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NYYX", "text": "I reorder these all year for my daughter for school bc she only wants to wear these because they are the most comfortable socks", "title": "Good", "location_and_date": "Reviewed in the United States on July 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NYYX", "text": "They feel real good on my girls feet. Says she loves them.", "title": "Daughter says she loves the softness of the fabric", "location_and_date": "Reviewed in the United States on July 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JM4NYYX", "text": "I buy the plain socks then put different colors of lace on each pair. The ones shown are not finished yet. When they are finished and the matching hair bands are made, I will coke neck and show everyone the finished product.", "title": "Every pair is hand made", "location_and_date": "Reviewed in the United States on June 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B5SCGJCN", "text": "These socks were sold as unisex but as you can see in my photo the packaging says that they are Girls Cotton Knee Highs. I got them for my son, who’s too young to care about wearing girls socks but older boys might be less inclined to wear these.Interestingly, these girls socks don’t look like typical girls knee high socks. They look like boys crew dress socks but they are longer and reach to under the knee.The fabric is soft and rather thin. After one wear and washing there’s already some pilling. I don’t have high hopes for their longevity.Size wise, they fit as expected. According to the chart size medium fits shoe sizes 9-2.5. My son wears size 12.5 and the socks fit him well with room to grow.", "title": "Labeled as girls socks. Soft, thin fabric", "location_and_date": "Reviewed in the United States on April 24, 2023", "verified": false, "rating": "3.0"},
{"asin": "B0B5SCGJCN", "text": "These Amazon kids casual socks are a bit of a disappointment to me. The pictures make them look like they have some cushion and elasticity, but in reality they are fairly thin and not too stretchy. My kid said he enjoys wearing them, but I have concerns about quality and longevity.", "title": "Not bad, just not great", "location_and_date": "Reviewed in the United States on April 4, 2023", "verified": false, "rating": "3.0"},
{"asin": "B0B5SCGJCN", "text": "These Amazon knee high socks are sold as unisex, but the package I received said \"girls\".  I don't care, and neither did my 5-year-old son, but if your child is sensitive to those sorts of things keep this in mind.The socks are nicely made from a soft, stretchy, and fairly thin fabric.  They fit my 5-year-old son very nicely.  They easily come all the way up his calves with room to spare.  They don't slide down his calves or bunch up in his shoes.  He enjoys wearing them.I washed them in cold water and dried them on low heat.  They came out well and did not shrink, but they did get a little fuzzy feeling.All in all... fine socks.", "title": "Long and soft.", "location_and_date": "Reviewed in the United States on April 1, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0B5SCGJCN", "text": "I got these UNISex socks for my son.Well, turns out when they arrived, they actually say GIRL's!So I split the pack between my 8yo daughter and 5yo son.They do look like dress socks for boys.They do look like dressy/casual socks for girls.They do not look like unisex casual socks.On my 5yo the medium socks went just below my son's knees.On my 8yo the medium socks went just above my daughter's calves.The socks fit both kids fine as their shoe sizes are not that different.", "title": "Medium - Fits my 8yo and 5yo", "location_and_date": "Reviewed in the United States on April 8, 2023", "verified": false, "rating": "4.0"},
{"asin": "B0B5SCGJCN", "text": "My son is about 8 and I selected size small for him. However, it is too small. Also, on the packing, it is mentioned for \"girls\", very embarrassing for me.", "title": "Too small", "location_and_date": "Reviewed in the United States on April 3, 2023", "verified": false, "rating": "3.0"},
{"asin": "B0B5SCGJCN", "text": "These are some nice basic knee socks. They feel soft, cooling, and medium Y come up to but not over my daughter’s knees. Basic socks like this are nice to choose when the rest of my child’s outfit is really busy. She has some crazy busy patterned shorts, dresses and leggings, so these socks are nice to provide a neutral with those items. These are great for when her patterned socks would clash with the outfit. They are cozy and her shoes don’t eat them.", "title": "Good socks, cute and functional.", "location_and_date": "Reviewed in the United States on May 31, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0B5SCGJCN", "text": "These socks are great.  They feel soft and does not dry your skin like other socks.  The material looks good and the elasticity is just right--good stretch. The length is just right.  It goes well with shorts or with pants.  Also can be used as dress socks and can be folded down to their ankle if wearing a dress.  Overall, good quality and perfect for any occasion.  These are a good find.", "title": "Love them socks!", "location_and_date": "Reviewed in the United States on April 12, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0B5SCTBCP", "text": "I know these are more geared towards school uniforms, but my daughter loves to wear socks that come to her knees and I’m always on the look out for extra. These navy socks are a great value! You get 6 pairs! They are thin socks and my daughter says they are comfortable. She is 6 and wears a size 11 shoe. I ordered her a medium and they fit just a tad big. I’m glad I went with medium as I think small would’ve been too small.", "title": "Great socks", "location_and_date": "Reviewed in the United States on April 9, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0B5SCGJCN", "text": "My daughter is currently in a size 9t shoe, so I ordered the medium (says for sizes 9-2.5). It is large on her right now; the heel of the sock goes a couple of inches up her leg. I think perhaps the size ranges are a bit too large. That said, I think they will work fine once her foot gets a little bigger, but time will tell. They are a stretchy sock, and fairly thin but not overly thin. They do have a toe seam inside.", "title": "Too big for lower end of size range listed", "location_and_date": "Reviewed in the United States on April 6, 2023", "verified": false, "rating": "5.0"},
{"asin": "B0B5SCGJCN", "text": "These socks are great and will work just like we needed them to. However- they were listed on Amazon as unisex but the packaging said they were for girls. Socks are socks - but some boys might be bothered by it, and it would be best if the packaging matched the online description. Glad we have them though!", "title": "Good socks", "location_and_date": "Reviewed in the United States on April 7, 2023", "verified": false, "rating": "5.0"},
{"asin": "B07JL9HL6G", "text": "These are very thick.  They are great for fall and winter.  My girls love how these feel!", "title": "Thick!", "location_and_date": "Reviewed in the United States on June 27, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JL9HL6G", "text": "They are ok", "title": "I would recommend not for summer though", "location_and_date": "Reviewed in the United States on May 13, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JL9HL6G", "text": "I like it", "title": "They are good", "location_and_date": "Reviewed in the United States on June 20, 2023", "verified": true, "rating": "5.0"},
{"asin": "B07JL9HL6G", "text": "The tights are good and durable but they will pill up with little bits if you don't wash them delicate and with like items. Just a tip, but otherwise they are good tights!", "title": "They need special washing care!", "location_and_date": "Reviewed in the United States on March 8, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JL9HL6G", "text": "Perhaps my daughter is particularly hard on tights but all of these had holes within a couple of months.", "title": "Good but Not Very Durable", "location_and_date": "Reviewed in the United States on March 5, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JL9HL6G", "text": "Heavier than anticipated", "title": "Girls tights", "location_and_date": "Reviewed in the United States on February 28, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JL9H13B", "text": "Great quality but too tightI bought m size for 9yr old girlAnd she’s skinny but it’s very tight on her9yr old should buy size large", "title": "Great quality but too tight", "location_and_date": "Reviewed in the United States on January 7, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JM63PBC", "text": "Size 14-16 didn't fit for 12 y.o. who is 4'9 and 100 lb.", "title": "The quality is seems to be fine, however it is much smaller than expected", "location_and_date": "Reviewed in the United States on January 2, 2023", "verified": true, "rating": "4.0"},
{"asin": "B07JL9HL6G", "text": "Bought these for my granddaughter. She loves these tights.", "title": "Amazon essentials girls tights", "location_and_date": "Reviewed in the United States on December 10, 2022", "verified": true, "rating": "4.0"},
{"asin": "B07JL9HL6G", "text": "They are cute and decent quality, I bought them for my 11yo they say 12/14 on the interior which is her size however she can not pull them up maybe they meant 12/14 months, but when someone said there 7yo used them I thought the sizing would be fine… but I missed the return window she simply put them in her drawer until she needed them of course…", "title": "Runs small", "location_and_date": "Reviewed in the United States on February 2, 2023", "verified": true, "rating": "3.0"},
{"asin": "B09K519DVK", "text": "Reasonable price. Basically all Cotton.  Very soft.  Reversed fit fuzzy sock for 2 of the styles of socks but nice tight fit, nice stretch, very cute colors and animal design.  These don't have the silicone bumps for traction and anti-slip but that's fine by me. Durable and strong.  Sometime Amazon Basics fail but these don't.  No compromise with these.  Great quality.  I’m glad I found these was looking for socks for over a month not kidding.  I need at least 95% cotton and under a dollar (I refuse to pay over a dollar each for kids socks how ridiculous for all the others to cost so much no material think about it) and these were spot on.  And cute to boot!", "title": "All the cotton I wanted and under a 1$ each.", "location_and_date": "Reviewed in the United States on March 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K519DVK", "text": "Thick, warm, and cute. Perfect winter socks for babies", "title": "Warm", "location_and_date": "Reviewed in the United States on March 13, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K519DVK", "text": "My daughter loves these socks.", "title": "Super comfy!", "location_and_date": "Reviewed in the United States on March 6, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K519DVK", "text": "Very good!", "title": "Excellent!", "location_and_date": "Reviewed in the United States on February 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K519DVK", "text": "Above comments", "title": "Good quality,pretty colors,fits perfect & stays on! Luv them", "location_and_date": "Reviewed in the United States on January 28, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K519DVK", "text": "great granddaughters", "title": "how cute they are!", "location_and_date": "Reviewed in the United States on December 18, 2022", "verified": true, "rating": "5.0"},
{"asin": "B09K519DVK", "text": "This is truly a really nice set of baby boy socks. It’s a nice selection of color, splash design, they are soft, and they are made well. Very good stitching. And they are not tight on the foot either.Babies grow very fast.My grandson is eight months, old, and the biggest size available barely fits him. Barely.The 6 to 12 months size is way too small for my eight month old grandson, but I understand that every baby has different feet so you have to pay attention to a more specific type of sizing i.e. actual measurement of the foot and common sense – chubby feet equals, bigger, socks, that type of thingPurchasing the socks in an 18 month old size is how I fixed the issue at hand.But I really do like this set of socks, and in my personal situation, going up to the next size level is what I needed for a more comfortable fit.", "title": "Cute socks", "location_and_date": "Reviewed in the United States on January 18, 2023", "verified": false, "rating": "4.0"},
{"asin": "B09K519DVK", "text": "These are perfect for the little one to grow with at a great value.  They're very soft and cute.LIKES+ Soft+ Value+ Machine WashableDISLIKES- None", "title": "Great Value", "location_and_date": "Reviewed in the United States on April 24, 2023", "verified": false, "rating": "5.0"},
{"asin": "B09K519DVK", "text": "These 6 pairs of socks are very thick and squishy!  They will be perfect for cold seasons, and the colors and puppy details are super cute.  This is a great deal for some quality warm baby socks.", "title": "Very Squishy Baby Socks", "location_and_date": "Reviewed in the United States on January 13, 2023", "verified": false, "rating": "4.0"},
{"asin": "B09K519DVK", "text": "These socks are really soft and have a good bit of stretch. The 6-12 month size fits my toddler who has size 4 feet, so they appear to be true to size. They don't slide down easily, but it can be a bit slippery on tile or wood for new walkers since there are no grips on the bottom.Overall, these socks wash well and are really cute. They seem to hold up in the washer and dryer. Great value!", "title": "Great socks with stretch, no grips", "location_and_date": "Reviewed in the United States on January 12, 2023", "verified": false, "rating": "4.0"},
{"asin": "B09K4YJ7LK", "text": "Basic socks. Would be better if infant had shoes on to prevent them from falling off.", "title": "Basic socks. Would be better if infant had shoes on to prevent them from falling off.", "location_and_date": "Reviewed in the United States on March 15, 2023", "verified": true, "rating": "4.0"},
{"asin": "B09K4YJ7LK", "text": "These socks are adorable and very well made. They are a thicker cotton than any of our other ruffled socks. Seem like they will hold up rather well. The double ruffle is super cute!! The fit is great My daughter is 2 years old and wears a size 7 toddler shoe and I will definitely order more in different patterns.", "title": "comfortable", "location_and_date": "Reviewed in the United States on January 7, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YJ7LK", "text": "Purchased multiple packs when they had Amazing deal on these. Great socks.", "title": "Great socks", "location_and_date": "Reviewed in the United States on March 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YJ7LK", "text": "Bought for a gift and they came as described and fit as expected", "title": "As described", "location_and_date": "Reviewed in the United States on February 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YJ7LK", "text": "Good socks. My daughter has to wear shoes at daycare and I was looking for socks without the grippers on the bottom, and these are that.", "title": "Good socks", "location_and_date": "Reviewed in the United States on December 15, 2022", "verified": true, "rating": "5.0"},
{"asin": "B09K4YJ7LK", "text": "Love the quality and deal. Washable, nice colors and beautifully designed", "title": "Great quality and comfortable", "location_and_date": "Reviewed in the United States on January 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09K4YJ7LK", "text": "Didn’t fit my baby too small was squeezing his little feet.", "title": "Didn’t fit", "location_and_date": "Reviewed in the United States on May 5, 2023", "verified": true, "rating": "2.0"},
{"asin": "B09K4YJ7LK", "text": "These socks constantly bunch up at the bottom of the ankle and work themselves off. Don’t recommend at all.", "title": "Won’t stay up", "location_and_date": "Reviewed in the United States on January 25, 2023", "verified": true, "rating": "2.0"},
{"asin": "B09K4YJ7LK", "text": "If your child actually wears and plays in socks, pay the extra money and get Jeffries instead. These fell apart after only a few wears.", "title": "Unraveled and poorly made", "location_and_date": "Reviewed in the United States on November 13, 2022", "verified": true, "rating": "2.0"},
{"asin": "B09K4YJ7LK", "text": "These are so cute and super soft. I love the little cuff with low sneakers.", "title": "Adorable", "location_and_date": "Reviewed in the United States on March 10, 2023", "verified": false, "rating": "4.0"}
]